{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from dotenv import load_dotenv\n",
    "load_dotenv()\n",
    "\n",
    "import logging\n",
    "import sys\n",
    "date_strftime_format = \"%Y-%m-%y %H:%M:%S\"\n",
    "logging.basicConfig(level=logging.DEBUG, format=\"%(asctime)s %(message)s\", datefmt=date_strftime_format)\n",
    "\n",
    "from falkordb_gemini_kg.models.openai import (\n",
    "  OpenAiGenerativeModel\n",
    ")\n",
    "from falkordb_gemini_kg.models.gemini import GeminiGenerativeModel\n",
    "from falkordb_gemini_kg import KnowledgeGraph, Ontology, KnowledgeGraphModelConfig\n",
    "from falkordb_gemini_kg.classes.source import Source, HTML\n",
    "import vertexai\n",
    "import os\n",
    "import json\n",
    "from falkordb import FalkorDB\n",
    "\n",
    "# Initialize the Vertex AI client\n",
    "vertexai.init(project=os.getenv(\"PROJECT_ID\"), location=os.getenv(\"REGION\"))\n",
    "\n",
    "model = OpenAiGenerativeModel(\"gpt-4o\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "sources = [\n",
    "  Source(\"./data/raw/animals.txt\")\n",
    "]\n",
    "# src_files = \"./data/raw\"\n",
    "# # For each file in the source directory, create a new Source object\n",
    "# for file in os.listdir(src_files):\n",
    "#     print(os.path.join(src_files, file))\n",
    "#     sources.append(Source(os.path.join(src_files, file)))\n",
    "\n",
    "# urls_files = \"./data/policies\"\n",
    "\n",
    "# for file in os.listdir(urls_files):\n",
    "#     print(os.path.join(urls_files, file))\n",
    "#     sources.append(HTML(os.path.join(urls_files, file)))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "2024-07-24 11:06:38 load_ssl_context verify=True cert=None trust_env=True http2=False\n",
      "2024-07-24 11:06:38 load_verify_locations cafile='/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/certifi/cacert.pem'\n",
      "2024-07-24 11:06:38 Request options: {'method': 'post', 'url': '/chat/completions', 'files': None, 'json_data': {'messages': [{'role': 'system', 'content': '\\n## 1. Overview\\n\"\\nYou are a top-tier algorithm designed for extracting ontologies in structured formats to build a knowledge graph from raw texts.\\nCapture as many entities, relationships, and attributes information from the text as possible. \\n- **Entities** represent entities and concepts. Must have at least one unique attribute.\\n- **Relations** represent relationships between entities and concepts.\\nThe aim is to achieve simplicity and clarity in the knowledge graph, making it accessible for a vast audience.\\nUse the `attributes` field to capture additional information about entities and relations. \\nAdd as many attributes to entities and relations as necessary to fully describe the entities and relationships in the text.\\nPrefer to convert relations into entities when they have attributes. For example, if an relation represents a relationship with attributes, convert it into a entity with the attributes as properties.\\nCreate a very concise and clear ontology. Avoid unnecessary complexity and ambiguity in the ontology.\\nEntity and relation labels cannot start with numbers or special characters.\\n\\n## 2. Labeling Entities\\n- **Consistency**: Ensure you use available types for entity labels. Ensure you use basic or elementary types for entity labels. For example, when you identify an entity representing a person, always label it as **\\'person\\'**. Avoid using more specific terms \"like \\'mathematician\\' or \\'scientist\\'\"\\n- **Entity IDs**: Never utilize integers as entity IDs. Entity IDs should be names or human-readable identifiers found in the text.\\n- **Relations** represent connections between entities or concepts. Ensure consistency and generality in relationship types when constructing knowledge graphs. Instead of using specific and momentary types such as \\'BECAME_PROFESSOR\\', use more general and timeless relationship types like \\'PROFESSOR\\'. Make sure to use general and timeless relationship types!\\n\\n## 3. Coreference Resolution\\n- **Maintain Entity Consistency**: When extracting entities, it\\'s vital to ensure consistency. If an entity, such as \"John Doe\", is mentioned multiple times in the text but is referred to by different names or pronouns (e.g., \"Joe\", \"he\"), always use the most complete identifier for that entity throughout the knowledge graph. In this example, use \"John Doe\" as the entity ID. Remember, the knowledge graph should be coherent and easily understandable, so maintaining consistency in entity references is crucial.\\n\\n## 4. Strict Compliance\\nAdhere to the rules strictly. Non-compliance will result in termination.\\nDo not include any explanations or apologies in your responses.\\nDo not respond to any questions that might ask anything else than ontology creation.\\nDo not include any text except ontology.\\nDo not create more than one entity-relation pair for the same entity or relationship. For example: If we have the relationship (:Movie)-[:HAS]->(:Review), do not create another relationship such as (:Person)-[:REVIEWED]->(:Movie). Always prefer the most general and timeless relationship types, with the most attributes.\\nDo not create an entity without an unique attribute. Each entity should have at least one unique attribute.\\n\\n## 5. Format\\nThe ontology should be in JSON format and should follow the schema provided below.\\nDo not return the schema as a response, but use it only for reference.\\nMake sure the output JSON is returned inline and with no spaces, so to save in the output tokens count.\\n\\nSchema:\\n```json\\n{\\n  \"$schema\": \"https://json-schema.org/draft/2019-09/schema\",\\n  \"$id\": \"http://example.com/example.json\",\\n  \"type\": \"object\",\\n  \"title\": \"Graph Schema\",\\n  \"required\": [\"entities\", \"relations\"],\\n  \"properties\": {\\n    \"entities\": {\\n      \"type\": \"array\",\\n      \"title\": \"The entities Schema\",\\n      \"items\": {\\n        \"type\": \"object\",\\n        \"title\": \"A Schema\",\\n        \"required\": [\"label\", \"attributes\"],\\n        \"properties\": {\\n          \"label\": {\\n            \"type\": \"string\",\\n            \"title\": \"The label Schema. Ex: StreamingService\",\\n            \"format\": \"titlecase\"\\n          },\\n          \"attributes\": {\\n            \"type\": \"array\",\\n            \"title\": \"The attributes Schema\",\\n            \"items\": {\\n              \"type\": \"object\",\\n              \"title\": \"A Schema\",\\n              \"required\": [\"name\", \"type\", \"unique\", \"required\"],\\n              \"properties\": {\\n                \"name\": {\\n                  \"type\": \"string\",\\n                  \"title\": \"The name Schema\",\\n                  \"format\": \"snakecase\"\\n                },\\n                \"type\": {\\n                  \"type\": \"string\",\\n                  \"enum\": [\"string\", \"number\", \"boolean\"],\\n                  \"title\": \"The type Schema\"\\n                },\\n                \"unique\": {\\n                  \"type\": \"boolean\",\\n                  \"title\": \"The unique Schema. Must have at least one unique attribute\"\\n                },\\n                \"required\": {\\n                  \"type\": \"boolean\",\\n                  \"title\": \"The required Schema. If the attribute is required, it cannot be null or empty\"\\n                }\\n              }\\n            }\\n          }\\n        }\\n      }\\n    },\\n    \"relations\": {\\n      \"type\": \"array\",\\n      \"title\": \"The relations Schema\",\\n      \"items\": {\\n        \"type\": \"object\",\\n        \"title\": \"A Schema\",\\n        \"required\": [\"label\", \"source\", \"target\"],\\n        \"properties\": {\\n          \"label\": {\\n            \"type\": \"string\",\\n            \"title\": \"The label Schema\",\\n            \"format\": \"uppercase\"\\n          },\\n          \"source\": {\\n            \"type\": \"object\",\\n            \"title\": \"The source Schema\",\\n            \"required\": [\"label\"],\\n            \"properties\": {\\n              \"label\": {\\n                \"type\": \"string\",\\n                \"format\": \"titlecase\",\\n                \"title\": \"The label Schema\"\\n              }\\n            }\\n          },\\n          \"target\": {\\n            \"type\": \"object\",\\n            \"title\": \"The target Schema\",\\n            \"required\": [\"label\"],\\n            \"properties\": {\\n              \"label\": {\\n                \"type\": \"string\",\\n                \"format\": \"titlecase\",\\n                \"title\": \"The label Schema\"\\n              }\\n            }\\n          },\\n          \"attributes\": {\\n            \"type\": \"array\",\\n            \"title\": \"The attributes Schema\",\\n            \"items\": {\\n              \"type\": \"object\",\\n              \"title\": \"A Schema\",\\n              \"required\": [\"name\", \"type\", \"unique\"],\\n              \"properties\": {\\n                \"name\": {\\n                  \"type\": \"string\",\\n                  \"title\": \"The name of the attribute\",\\n                  \"format\": \"snakecase\"\\n                },\\n                \"type\": {\\n                  \"type\": \"string\",\\n                  \"enum\": [\"string\", \"number\", \"boolean\"],\\n                  \"title\": \"The type of the attribute\"\\n                },\\n                \"unique\": {\\n                  \"type\": \"boolean\",\\n                  \"title\": \"If the attribute is unique or not between different relations of the same label\"\\n                },\\n                \"required\": {\\n                  \"type\": \"boolean\",\\n                  \"title\": \"If the attribute is required or not\"\\n                }\\n              }\\n            }\\n          }\\n        }\\n      }\\n    }\\n  }\\n}\\n```\\n\\nFor example:\\n```\\n{\"entities\":[{\"label\":\"Person\",\"attributes\":[{\"name\":\"name\",\"type\":\"string\",\"unique\":true,\"required\":true},{\"name\":\"age\",\"type\":\"number\",\"unique\":false,\"unique\":false}]},{\"label\":\"Movie\",\"attributes\":[{\"name\":\"title\",\"type\":\"string\",\"unique\":true,\"required\":true},{\"name\":\"releaseYear\",\"type\":\"number\",\"unique\":false,\"required\":false}]}],\"relations\":[{\"label\":\"ACTED_IN\",\"source\":{\"label\":\"Person\"},\"target\":{\"label\":\"Movie\"},\"attributes\":[{\"name\":\"role\",\"type\":\"string\",\"unique\":false,\"required\":true}]}}\\n```\\n\\nDo not use the example Movie context to assume the ontology. The ontology should be created based on the provided text only.\\n\\n'}, {'role': 'user', 'content': '\\nGiven the following text, create the ontology that represents the entities and relationships in the data.\\nExtract as many entities and relations as possible to fully describe the data.\\nExtract as attributes as possible to fully describe the entities and relationships in the text.\\nAttributes should be extracted as entities or relations whenever possible. For example, when describing a Movie entity, the \"director\" attribute can be extracted as a entity \"Person\" and connected to the \"Movie\" entity with an relation labeled \"DIRECTED\".\\nFor example, when describing a Movie entity, you can extract attributes like title, release year, genre, and more.\\nMake sure to connect all related entities in the ontology. For example, if a Person PLAYED a Character in a Movie, make sure to connect the Character back to the Movie, otherwise we won\\'t be able to say which Movie the Character is from.\\n\\nDo not create relationships without their corresponding entities.\\nDo not allow duplicated inverse relationships, for example, if you have a relationship \"OWNS\" from Person to House, do not create another relationship \"OWNED_BY\" from House to Person.\\nDo not use the example Movie context to assume the ontology. The ontology should be created based on the provided text only.\\nDo not create an entity without an unique attribute. Each entity should have at least one unique attribute.\\n\\nUse the following instructions as boundaries for the ontology extraction process. \\n\\n  The ontology should be pertinent only to the information about animals you can bring on board.\\n\\n\\nRaw text:\\nWe know how important your pets are to you, which is why we strive to extend our world-class service to your furry and feathered friends when they travel. Qatar Airways accepts domesticated dogs, cats and birds as checked baggage, either on your flight or on a separate one, in accordance with international air travel regulations.\\xa0To ensure compliance with the regulations of all countries you will fly to, please let us know if you would like to travel with your pet at least 48 hours before departure.Travel regulations require you to make all necessary documentation for your pet available before travel. Such documents include their health certificate (signed by your veterinarian, indicating that the animal is fit to fly) and identification or pet passport.You can now fill in an online form to submit a request for carriage of pets using the link below.\\xa0 Submit a request var ulTag = $(\".whitefontP\").find(\"ul\").addClass(\\'bulleted-list\\');var logoTexColor = \"maroon\";if (logoTexColor == \\'white\\') { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>\\');} else { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>\\');} Service dogs On certain routes, Qatar Airways allows service dogs in the passenger cabin, free of charge, to accompany a passenger with a disability. On all other routes, service dogs will be accepted free of charge as checked baggage within the aircraft hold.Not all countries allow service animals to arrive in the passenger cabin of the aircraft. Please contact us to verify any limitations that may exist for the countries in your itinerary.\\xa0 Browse FAQs var ulTag = $(\".whitefontP\").find(\"ul\").addClass(\\'bulleted-list\\');var logoTexColor = \"maroon\";if (logoTexColor == \\'white\\') { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>\\');} else { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>\\');} Falcons You can carry one falcon in the Economy Class cabin of an aircraft, and a maximum of six falcons are permitted within the Economy Class cabin of any one aircraft (country regulations may apply).\\xa0For your pet’s well-being, Qatar Airways reserves the right to refuse the transport of any animal if we find the container is too small. Travelling with pets as checked baggage Domesticated dogs, cats and birds are accepted as checked baggage provided that the animal is in good health and all transport requirements are met.\\xa0Service dog(s) can be transported in the cabin free of charge when travelling on specific routes.If a falcon is transported as checked baggage and not in the cabin, travelling cost of animals as checked baggage will apply.For cost information, see our excess baggage page. var ulTag = $(\".whitefontP\").find(\"ul\").addClass(\\'bulleted-list\\');var logoTexColor = \"maroon\";if (logoTexColor == \\'white\\') { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>\\');} else { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>\\');} $(document).ready(function () { if ($(window).width() < 767) { $(\".content-container-list .slick-track\").find(\\'li\\').removeClass(\"fade\"); } }); Pet containers Pet food Care during transfer Discover lable Pet containers Pet food Care during transfer Pet containers Your pet\\'s travel container must be of an adequate size and be equipped with sufficient openings for ventilation. It must also be of suitable design and sufficient strength to prevent escape.There are also limits on including more than one pet per container.\\xa0For your pet’s well-being, Qatar Airways reserves the right to refuse the transport of any animal if we find the container is too small. More information Pet food We recommend\\xa0that you provide enough food and water for your pet’s journey in the travelling container or kennel, as you will not be able to access your pet during the journey.When preparing your food and water containers, consider the below:Food and water containers must be present and affixed within the shipping container with provision to fill it from the outside that does not require the opening of the shipping container.Water bottles or similar dispensers that are attached inside or outside the shipping container are not considered suitable for refilling.\\xa0If food is not provided by the owner, our ground services staff in Doha will provide your pet with food every three to four hours (up to two hours before departure), while water is changed every hour (provided that the water container attached to the kennel can be refilled from the outside) on the ground between connecting flights. var ulTag = $(\".whitefontP\").find(\"ul\").addClass(\\'bulleted-list\\');var logoTexColor = \"maroon\";if (logoTexColor == \\'white\\') { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>\\');} else { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>\\');} Pet care during transfer in Doha We aim to give your animals the utmost care during their journey with us, including any time on the ground between connecting flights.\\xa0\\xa0If your transfer time in Doha is more than 3 hours, our ground staff will make sure that:Animals are allowed out of their kennels to walk and stretch;Animals are observed for signs of sickness and stress;Kennels are cleaned;Dogs are walked;Animals are provided a larger, more comfortable kennel during transit.If your transfer time in Doha is less than 3 hours, including if your planned transit changes to less than 3 hours due to operational reasons, these services will not be provided. Rest assured, all animals are\\xa0monitored by our ground staff in the dedicated holding area between connecting flights.\\xa0 var ulTag = $(\".whitefontP\").find(\"ul\").addClass(\\'bulleted-list\\');var logoTexColor = \"maroon\";if (logoTexColor == \\'white\\') { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>\\');} else { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>\\');} Health, breed or age restrictions Qatar Airways does not permit transport of certain breeds of dogs and cats as these animals are normally susceptible to increased risk of heat stroke when exposed to stress or temperatures above 21°C (69.8°F). Learn more var ulTag = $(\".whitefontP\").find(\"ul\").addClass(\\'bulleted-list\\');var logoTexColor = \"maroon\";if (logoTexColor == \\'white\\') { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>\\');} else { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>\\');} Does your itinerary include other airlines? Qatar Airways does not accept transporting animals transferring from flights operated by other airlines. However, transporting animals from Qatar Airways to other airlines is permitted.\\xa0If you plan to connect onwards after your Qatar Airways flight when travelling with your pet, you must ensure all the necessary arrangements are made with the carriers involved. var ulTag = $(\".whitefontP\").find(\"ul\").addClass(\\'bulleted-list\\');var logoTexColor = \"maroon\";if (logoTexColor == \\'white\\') { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>\\');} else { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>\\');} Travelling with our partners? Find more information here if your journey includes a flight with one of our partners. American Airlines British Airways Royal Air Maroc Restrictions on dogs from high risk countries into the U.S. and CanadaClosed Travelling to the United StatesThere is a temporary suspension for dogs arriving into the United States from countries that CDC considers high risk for dog rabies. This includes dogs that have been in any high-risk country during the previous 6 months.Dogs from high-risk countries may be brought into the U.S. only with CDC’s advance written approval (CDC Dog Import Permit) which must be provided at the time of requesting a dog either as a service animal or as checked baggage.\\xa0View more information on the\\xa0CDC website.Travelling to CanadaEffective 28 September 2022, commercial dogs from high-risk countries for dog rabies will no longer be permitted entry into Canada. Personal or assistance dogs originating from high-risk countries will continue to be permitted entry provided all import and documentation requirements are met. View more information on the Canadian Government\\'s website.\\xa0 var ulTag = $(\".whitefontP\").find(\"ul\").addClass(\\'bulleted-list\\');var logoTexColor = \"maroon\";if (logoTexColor == \\'white\\') { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>\\');} else { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>\\');} Restrictions on transporting animals to and from Australia or New ZealandClosed Due to local regulations, Qatar Airways only accepts animals travelling to or from Australia or New Zealand as Cargo.For further information travelling from Australia or New Zealand, please contact your nearest\\xa0Qatar Airways Cargo office.\\xa0When travelling to Australia, note that animals can only be transported through Melbourne (MEL). For further information, please contact Post Entry Quarantine Services at PEQservices@agriculture.gov.au or phone at 1800 900 090 or (61 3) 8318 6700 (from outside Australia)\\xa0 \\xa0 \\xa0 \\xa0 \\xa0 \\xa0 \\xa0\\xa0 var ulTag = $(\".whitefontP\").find(\"ul\").addClass(\\'bulleted-list\\');var logoTexColor = \"maroon\";if (logoTexColor == \\'white\\') { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>\\');} else { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>\\');} In addition, please refer to the \\'Visa and other requirements\\' section here to view customs restrictions that may apply for your journey. var ulTag = $(\".whitefontP\").find(\"ul\").addClass(\\'bulleted-list\\');var logoTexColor = \"maroon\";if (logoTexColor == \\'white\\') { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>\\');} else { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>\\');}\\n'}], 'model': 'gpt-4o', 'max_tokens': None, 'stop': None, 'temperature': None, 'top_p': None}}\n",
      "2024-07-24 11:06:38 Sending HTTP Request: POST https://api.openai.com/v1/chat/completions\n",
      "2024-07-24 11:06:38 connect_tcp.started host='api.openai.com' port=443 local_address=None timeout=5.0 socket_options=None\n",
      "2024-07-24 11:06:38 connect_tcp.complete return_value=<httpcore._backends.sync.SyncStream object at 0x11fb9bc50>\n",
      "2024-07-24 11:06:38 start_tls.started ssl_context=<ssl.SSLContext object at 0x10556a0f0> server_hostname='api.openai.com' timeout=5.0\n",
      "2024-07-24 11:06:38 start_tls.complete return_value=<httpcore._backends.sync.SyncStream object at 0x11fb79650>\n",
      "2024-07-24 11:06:38 send_request_headers.started request=<Request [b'POST']>\n",
      "2024-07-24 11:06:38 send_request_headers.complete\n",
      "2024-07-24 11:06:38 send_request_body.started request=<Request [b'POST']>\n",
      "2024-07-24 11:06:38 send_request_body.complete\n",
      "2024-07-24 11:06:38 receive_response_headers.started request=<Request [b'POST']>\n",
      "2024-07-24 11:06:45 receive_response_headers.complete return_value=(b'HTTP/1.1', 200, b'OK', [(b'Date', b'Thu, 11 Jul 2024 08:06:46 GMT'), (b'Content-Type', b'application/json'), (b'Transfer-Encoding', b'chunked'), (b'Connection', b'keep-alive'), (b'openai-organization', b'falkordb'), (b'openai-processing-ms', b'6842'), (b'openai-version', b'2020-10-01'), (b'strict-transport-security', b'max-age=31536000; includeSubDomains'), (b'x-ratelimit-limit-requests', b'10000'), (b'x-ratelimit-limit-tokens', b'22000000'), (b'x-ratelimit-remaining-requests', b'9999'), (b'x-ratelimit-remaining-tokens', b'21994966'), (b'x-ratelimit-reset-requests', b'6ms'), (b'x-ratelimit-reset-tokens', b'13ms'), (b'x-request-id', b'req_6f7c78f0ff97f2ef0c34ff6fb79210ee'), (b'CF-Cache-Status', b'DYNAMIC'), (b'Set-Cookie', b'__cf_bm=3K4uNKRz0yQdUq5LDAUx.1ZDrjrzPXpSg6Jld2PjN8E-1720685206-1.0.1.1-wPHqdnEKudBqZ8cJKC7V4s3EwU64WZ9dUbUbyE74jE_jpAeDj71eh6QCY1sp6Qq_1rIrJ15LcwaUvI3sE0bp0g; path=/; expires=Thu, 11-Jul-24 08:36:46 GMT; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), (b'Set-Cookie', b'_cfuvid=zBx3VcNC.MVRSFA1DSyz_OVU5xAFfyht2sdvEWQF_kE-1720685206050-0.0.1.1-604800000; path=/; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), (b'Server', b'cloudflare'), (b'CF-RAY', b'8a174b9ccee60e77-MXP'), (b'Content-Encoding', b'gzip'), (b'alt-svc', b'h3=\":443\"; ma=86400')])\n",
      "2024-07-24 11:06:45 HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "2024-07-24 11:06:45 receive_response_body.started request=<Request [b'POST']>\n",
      "2024-07-24 11:06:45 receive_response_body.complete\n",
      "2024-07-24 11:06:45 response_closed.started\n",
      "2024-07-24 11:06:45 response_closed.complete\n",
      "2024-07-24 11:06:45 HTTP Response: POST https://api.openai.com/v1/chat/completions \"200 OK\" Headers([('date', 'Thu, 11 Jul 2024 08:06:46 GMT'), ('content-type', 'application/json'), ('transfer-encoding', 'chunked'), ('connection', 'keep-alive'), ('openai-organization', 'falkordb'), ('openai-processing-ms', '6842'), ('openai-version', '2020-10-01'), ('strict-transport-security', 'max-age=31536000; includeSubDomains'), ('x-ratelimit-limit-requests', '10000'), ('x-ratelimit-limit-tokens', '22000000'), ('x-ratelimit-remaining-requests', '9999'), ('x-ratelimit-remaining-tokens', '21994966'), ('x-ratelimit-reset-requests', '6ms'), ('x-ratelimit-reset-tokens', '13ms'), ('x-request-id', 'req_6f7c78f0ff97f2ef0c34ff6fb79210ee'), ('cf-cache-status', 'DYNAMIC'), ('set-cookie', '__cf_bm=3K4uNKRz0yQdUq5LDAUx.1ZDrjrzPXpSg6Jld2PjN8E-1720685206-1.0.1.1-wPHqdnEKudBqZ8cJKC7V4s3EwU64WZ9dUbUbyE74jE_jpAeDj71eh6QCY1sp6Qq_1rIrJ15LcwaUvI3sE0bp0g; path=/; expires=Thu, 11-Jul-24 08:36:46 GMT; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), ('set-cookie', '_cfuvid=zBx3VcNC.MVRSFA1DSyz_OVU5xAFfyht2sdvEWQF_kE-1720685206050-0.0.1.1-604800000; path=/; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), ('server', 'cloudflare'), ('cf-ray', '8a174b9ccee60e77-MXP'), ('content-encoding', 'gzip'), ('alt-svc', 'h3=\":443\"; ma=86400')])\n",
      "2024-07-24 11:06:45 request_id: req_6f7c78f0ff97f2ef0c34ff6fb79210ee\n",
      "2024-07-24 11:06:45 Model response: GenerationResponse(text=```\n",
      "{\"entities\":[{\"label\":\"Airline\",\"attributes\":[{\"name\":\"name\",\"type\":\"string\",\"unique\":true,\"required\":true}]},{\"label\":\"Pet\",\"attributes\":[{\"name\":\"type\",\"type\":\"string\",\"unique\":false,\"required\":true},{\"name\":\"travel_method\",\"type\":\"string\",\"unique\":false,\"required\":false},{\"name\":\"health_status\",\"type\":\"string\",\"unique\":false,\"required\":false},{\"name\":\"route\",\"type\":\"string\",\"unique\":false,\"required\":false}]},{\"label\":\"HealthCertificate\",\"attributes\":[{\"name\":\"signed_by\",\"type\":\"string\",\"unique\":false,\"required\":true},{\"name\":\"fit_to_fly\",\"type\":\"boolean\",\"unique\":false,\"required\":true}]},{\"label\":\"PetContainer\",\"attributes\":[{\"name\":\"size\",\"type\":\"string\",\"unique\":false,\"required\":false},{\"name\":\"ventilation\",\"type\":\"string\",\"unique\":false,\"required\":false},{\"name\":\"design\",\"type\":\"string\",\"unique\":false,\"required\":false},{\"name\":\"strength\",\"type\":\"string\",\"unique\":false,\"required\":false}]},{\"label\":\"Nationality\",\"attributes\":[{\"name\":\"country\",\"type\":\"string\",\"unique\":true,\"required\":true}]},{\"label\":\"Document\",\"attributes\":[{\"name\":\"type\",\"type\":\"string\",\"unique\":false,\"required\":true},{\"name\":\"source\",\"type\":\"string\",\"unique\":false,\"required\":false},{\"name\":\"required\",\"type\":\"boolean\",\"unique\":false,\"required\":false}]},{\"label\":\"ServiceDog\",\"attributes\":[{\"name\":\"route\",\"type\":\"string\",\"unique\":false,\"required\":false},{\"name\":\"cabin_free_of_charge\",\"type\":\"boolean\",\"unique\":false,\"required\":false}]},{\"label\":\"Country\",\"attributes\":[{\"name\":\"name\",\"type\":\"string\",\"unique\":true,\"required\":true}]}],\"relations\":[{\"label\":\"ACCEPTS\",\"source\":{\"label\":\"Airline\"},\"target\":{\"label\":\"Pet\"}},{\"label\":\"HAS\",\"source\":{\"label\":\"Pet\"},\"target\":{\"label\":\"HealthCertificate\"}},{\"label\":\"REQUIRES\",\"source\":{\"label\":\"Airline\"},\"target\":{\"label\":\"Document\"}},{\"label\":\"USES\",\"source\":{\"label\":\"Pet\"},\"target\":{\"label\":\"PetContainer\"}},{\"label\":\"ALLOWS\",\"source\":{\"label\":\"Airline\"},\"target\":{\"label\":\"ServiceDog\"}},{\"label\":\"HAS_RESTRICTIONS\",\"source\":{\"label\":\"Airline\"},\"target\":{\"label\":\"Country\"}}]}\n",
      "```, finish_reason=STOP)\n",
      "2024-07-24 11:06:45 Adding entity Airline\n",
      "2024-07-24 11:06:45 Adding entity Pet\n",
      "2024-07-24 11:06:45 Adding entity HealthCertificate\n",
      "2024-07-24 11:06:45 Adding entity PetContainer\n",
      "2024-07-24 11:06:45 Adding entity Nationality\n",
      "2024-07-24 11:06:45 Adding entity Document\n",
      "2024-07-24 11:06:45 Adding entity ServiceDog\n",
      "2024-07-24 11:06:45 Adding entity Country\n",
      "2024-07-24 11:06:45 Adding relation ACCEPTS\n",
      "2024-07-24 11:06:45 Adding relation HAS\n",
      "2024-07-24 11:06:45 Adding relation REQUIRES\n",
      "2024-07-24 11:06:45 Adding relation USES\n",
      "2024-07-24 11:06:45 Adding relation ALLOWS\n",
      "2024-07-24 11:06:45 Adding relation HAS_RESTRICTIONS\n",
      "2024-07-24 11:06:45 Processed document: <falkordb_gemini_kg.classes.Document.Document object at 0x11fb87090>\n",
      "2024-07-24 11:06:45 Fixing ontology...\n",
      "2024-07-24 11:06:45 Request options: {'method': 'post', 'url': '/chat/completions', 'files': None, 'json_data': {'messages': [{'role': 'system', 'content': '\\n## 1. Overview\\n\"\\nYou are a top-tier algorithm designed for extracting ontologies in structured formats to build a knowledge graph from raw texts.\\nCapture as many entities, relationships, and attributes information from the text as possible. \\n- **Entities** represent entities and concepts. Must have at least one unique attribute.\\n- **Relations** represent relationships between entities and concepts.\\nThe aim is to achieve simplicity and clarity in the knowledge graph, making it accessible for a vast audience.\\nUse the `attributes` field to capture additional information about entities and relations. \\nAdd as many attributes to entities and relations as necessary to fully describe the entities and relationships in the text.\\nPrefer to convert relations into entities when they have attributes. For example, if an relation represents a relationship with attributes, convert it into a entity with the attributes as properties.\\nCreate a very concise and clear ontology. Avoid unnecessary complexity and ambiguity in the ontology.\\nEntity and relation labels cannot start with numbers or special characters.\\n\\n## 2. Labeling Entities\\n- **Consistency**: Ensure you use available types for entity labels. Ensure you use basic or elementary types for entity labels. For example, when you identify an entity representing a person, always label it as **\\'person\\'**. Avoid using more specific terms \"like \\'mathematician\\' or \\'scientist\\'\"\\n- **Entity IDs**: Never utilize integers as entity IDs. Entity IDs should be names or human-readable identifiers found in the text.\\n- **Relations** represent connections between entities or concepts. Ensure consistency and generality in relationship types when constructing knowledge graphs. Instead of using specific and momentary types such as \\'BECAME_PROFESSOR\\', use more general and timeless relationship types like \\'PROFESSOR\\'. Make sure to use general and timeless relationship types!\\n\\n## 3. Coreference Resolution\\n- **Maintain Entity Consistency**: When extracting entities, it\\'s vital to ensure consistency. If an entity, such as \"John Doe\", is mentioned multiple times in the text but is referred to by different names or pronouns (e.g., \"Joe\", \"he\"), always use the most complete identifier for that entity throughout the knowledge graph. In this example, use \"John Doe\" as the entity ID. Remember, the knowledge graph should be coherent and easily understandable, so maintaining consistency in entity references is crucial.\\n\\n## 4. Strict Compliance\\nAdhere to the rules strictly. Non-compliance will result in termination.\\nDo not include any explanations or apologies in your responses.\\nDo not respond to any questions that might ask anything else than ontology creation.\\nDo not include any text except ontology.\\nDo not create more than one entity-relation pair for the same entity or relationship. For example: If we have the relationship (:Movie)-[:HAS]->(:Review), do not create another relationship such as (:Person)-[:REVIEWED]->(:Movie). Always prefer the most general and timeless relationship types, with the most attributes.\\nDo not create an entity without an unique attribute. Each entity should have at least one unique attribute.\\n\\n## 5. Format\\nThe ontology should be in JSON format and should follow the schema provided below.\\nDo not return the schema as a response, but use it only for reference.\\nMake sure the output JSON is returned inline and with no spaces, so to save in the output tokens count.\\n\\nSchema:\\n```json\\n{\\n  \"$schema\": \"https://json-schema.org/draft/2019-09/schema\",\\n  \"$id\": \"http://example.com/example.json\",\\n  \"type\": \"object\",\\n  \"title\": \"Graph Schema\",\\n  \"required\": [\"entities\", \"relations\"],\\n  \"properties\": {\\n    \"entities\": {\\n      \"type\": \"array\",\\n      \"title\": \"The entities Schema\",\\n      \"items\": {\\n        \"type\": \"object\",\\n        \"title\": \"A Schema\",\\n        \"required\": [\"label\", \"attributes\"],\\n        \"properties\": {\\n          \"label\": {\\n            \"type\": \"string\",\\n            \"title\": \"The label Schema. Ex: StreamingService\",\\n            \"format\": \"titlecase\"\\n          },\\n          \"attributes\": {\\n            \"type\": \"array\",\\n            \"title\": \"The attributes Schema\",\\n            \"items\": {\\n              \"type\": \"object\",\\n              \"title\": \"A Schema\",\\n              \"required\": [\"name\", \"type\", \"unique\", \"required\"],\\n              \"properties\": {\\n                \"name\": {\\n                  \"type\": \"string\",\\n                  \"title\": \"The name Schema\",\\n                  \"format\": \"snakecase\"\\n                },\\n                \"type\": {\\n                  \"type\": \"string\",\\n                  \"enum\": [\"string\", \"number\", \"boolean\"],\\n                  \"title\": \"The type Schema\"\\n                },\\n                \"unique\": {\\n                  \"type\": \"boolean\",\\n                  \"title\": \"The unique Schema. Must have at least one unique attribute\"\\n                },\\n                \"required\": {\\n                  \"type\": \"boolean\",\\n                  \"title\": \"The required Schema. If the attribute is required, it cannot be null or empty\"\\n                }\\n              }\\n            }\\n          }\\n        }\\n      }\\n    },\\n    \"relations\": {\\n      \"type\": \"array\",\\n      \"title\": \"The relations Schema\",\\n      \"items\": {\\n        \"type\": \"object\",\\n        \"title\": \"A Schema\",\\n        \"required\": [\"label\", \"source\", \"target\"],\\n        \"properties\": {\\n          \"label\": {\\n            \"type\": \"string\",\\n            \"title\": \"The label Schema\",\\n            \"format\": \"uppercase\"\\n          },\\n          \"source\": {\\n            \"type\": \"object\",\\n            \"title\": \"The source Schema\",\\n            \"required\": [\"label\"],\\n            \"properties\": {\\n              \"label\": {\\n                \"type\": \"string\",\\n                \"format\": \"titlecase\",\\n                \"title\": \"The label Schema\"\\n              }\\n            }\\n          },\\n          \"target\": {\\n            \"type\": \"object\",\\n            \"title\": \"The target Schema\",\\n            \"required\": [\"label\"],\\n            \"properties\": {\\n              \"label\": {\\n                \"type\": \"string\",\\n                \"format\": \"titlecase\",\\n                \"title\": \"The label Schema\"\\n              }\\n            }\\n          },\\n          \"attributes\": {\\n            \"type\": \"array\",\\n            \"title\": \"The attributes Schema\",\\n            \"items\": {\\n              \"type\": \"object\",\\n              \"title\": \"A Schema\",\\n              \"required\": [\"name\", \"type\", \"unique\"],\\n              \"properties\": {\\n                \"name\": {\\n                  \"type\": \"string\",\\n                  \"title\": \"The name of the attribute\",\\n                  \"format\": \"snakecase\"\\n                },\\n                \"type\": {\\n                  \"type\": \"string\",\\n                  \"enum\": [\"string\", \"number\", \"boolean\"],\\n                  \"title\": \"The type of the attribute\"\\n                },\\n                \"unique\": {\\n                  \"type\": \"boolean\",\\n                  \"title\": \"If the attribute is unique or not between different relations of the same label\"\\n                },\\n                \"required\": {\\n                  \"type\": \"boolean\",\\n                  \"title\": \"If the attribute is required or not\"\\n                }\\n              }\\n            }\\n          }\\n        }\\n      }\\n    }\\n  }\\n}\\n```\\n\\nFor example:\\n```\\n{\"entities\":[{\"label\":\"Person\",\"attributes\":[{\"name\":\"name\",\"type\":\"string\",\"unique\":true,\"required\":true},{\"name\":\"age\",\"type\":\"number\",\"unique\":false,\"unique\":false}]},{\"label\":\"Movie\",\"attributes\":[{\"name\":\"title\",\"type\":\"string\",\"unique\":true,\"required\":true},{\"name\":\"releaseYear\",\"type\":\"number\",\"unique\":false,\"required\":false}]}],\"relations\":[{\"label\":\"ACTED_IN\",\"source\":{\"label\":\"Person\"},\"target\":{\"label\":\"Movie\"},\"attributes\":[{\"name\":\"role\",\"type\":\"string\",\"unique\":false,\"required\":true}]}}\\n```\\n\\nDo not use the example Movie context to assume the ontology. The ontology should be created based on the provided text only.\\n\\n'}, {'role': 'user', 'content': '\\nGiven the following ontology, correct any mistakes or missing information in the ontology.\\nAdd any missing entities, relations, or attributes to the ontology.\\nMake sure to connect all related entities in the ontology. For example, if a Person PLAYED a Character in a Movie, make sure to connect the Character back to the Movie, otherwise we won\\'t be able to say which Movie the Character is from.\\nMake sure each entity contains at least one unique attribute.\\nMake sure all entities have relations.\\nMake sure all relations have 2 entities (source and target).\\nMake sure all entity labels are titlecase.\\nDo not allow duplicated relationships, for example, if you have a relationship \"OWNS\" from Person to House, do not create another relationship \"OWNS_HOUSE\", or even \"OWNED_BY\" from House to Person.\\nRelationship names must be timeless. For example \"WROTE\" and \"WRITTEN\" means the same thing, if the source and target entities are the same. Remove similar scenarios.\\nDo not create relationships without their corresponding entities.\\nDo not use the example Movie context to assume the ontology. The ontology should be created based on the provided text only.\\nDo not allow entities without at least one unique attribute.\\n\\nOntology:\\nEntities:\\n\\x0c- (:Airline {name: \"string!*\"})\\n- (:Pet {type: \"string*\", travel_method: \"string\", health_status: \"string\", route: \"string\"})\\n- (:HealthCertificate {signed_by: \"string*\", fit_to_fly: \"boolean*\"})\\n- (:PetContainer {size: \"string\", ventilation: \"string\", design: \"string\", strength: \"string\"})\\n- (:Nationality {country: \"string!*\"})\\n- (:Document {type: \"string*\", source: \"string\", required: \"boolean\"})\\n- (:ServiceDog {route: \"string\", cabin_free_of_charge: \"boolean\"})\\n- (:Country {name: \"string!*\"})\\n\\nEdges:\\n\\x0c- (:Airline)-[:ACCEPTS {}]->(:Pet)\\n- (:Pet)-[:HAS {}]->(:HealthCertificate)\\n- (:Airline)-[:REQUIRES {}]->(:Document)\\n- (:Pet)-[:USES {}]->(:PetContainer)\\n- (:Airline)-[:ALLOWS {}]->(:ServiceDog)\\n- (:Airline)-[:HAS_RESTRICTIONS {}]->(:Country)\\n'}], 'model': 'gpt-4o', 'max_tokens': None, 'stop': None, 'temperature': None, 'top_p': None}}\n",
      "2024-07-24 11:06:45 Sending HTTP Request: POST https://api.openai.com/v1/chat/completions\n",
      "2024-07-24 11:06:45 send_request_headers.started request=<Request [b'POST']>\n",
      "2024-07-24 11:06:45 send_request_headers.complete\n",
      "2024-07-24 11:06:45 send_request_body.started request=<Request [b'POST']>\n",
      "2024-07-24 11:06:45 send_request_body.complete\n",
      "2024-07-24 11:06:45 receive_response_headers.started request=<Request [b'POST']>\n",
      "2024-07-24 11:06:52 receive_response_headers.complete return_value=(b'HTTP/1.1', 200, b'OK', [(b'Date', b'Thu, 11 Jul 2024 08:06:53 GMT'), (b'Content-Type', b'application/json'), (b'Transfer-Encoding', b'chunked'), (b'Connection', b'keep-alive'), (b'openai-organization', b'falkordb'), (b'openai-processing-ms', b'6589'), (b'openai-version', b'2020-10-01'), (b'strict-transport-security', b'max-age=31536000; includeSubDomains'), (b'x-ratelimit-limit-requests', b'10000'), (b'x-ratelimit-limit-tokens', b'22000000'), (b'x-ratelimit-remaining-requests', b'9999'), (b'x-ratelimit-remaining-tokens', b'21997506'), (b'x-ratelimit-reset-requests', b'6ms'), (b'x-ratelimit-reset-tokens', b'6ms'), (b'x-request-id', b'req_b25e2a27a2964365839e59b8e4e16cde'), (b'CF-Cache-Status', b'DYNAMIC'), (b'Server', b'cloudflare'), (b'CF-RAY', b'8a174bca495a0e77-MXP'), (b'Content-Encoding', b'gzip'), (b'alt-svc', b'h3=\":443\"; ma=86400')])\n",
      "2024-07-24 11:06:52 HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "2024-07-24 11:06:52 receive_response_body.started request=<Request [b'POST']>\n",
      "2024-07-24 11:06:52 receive_response_body.complete\n",
      "2024-07-24 11:06:52 response_closed.started\n",
      "2024-07-24 11:06:52 response_closed.complete\n",
      "2024-07-24 11:06:52 HTTP Response: POST https://api.openai.com/v1/chat/completions \"200 OK\" Headers({'date': 'Thu, 11 Jul 2024 08:06:53 GMT', 'content-type': 'application/json', 'transfer-encoding': 'chunked', 'connection': 'keep-alive', 'openai-organization': 'falkordb', 'openai-processing-ms': '6589', 'openai-version': '2020-10-01', 'strict-transport-security': 'max-age=31536000; includeSubDomains', 'x-ratelimit-limit-requests': '10000', 'x-ratelimit-limit-tokens': '22000000', 'x-ratelimit-remaining-requests': '9999', 'x-ratelimit-remaining-tokens': '21997506', 'x-ratelimit-reset-requests': '6ms', 'x-ratelimit-reset-tokens': '6ms', 'x-request-id': 'req_b25e2a27a2964365839e59b8e4e16cde', 'cf-cache-status': 'DYNAMIC', 'server': 'cloudflare', 'cf-ray': '8a174bca495a0e77-MXP', 'content-encoding': 'gzip', 'alt-svc': 'h3=\":443\"; ma=86400'})\n",
      "2024-07-24 11:06:52 request_id: req_b25e2a27a2964365839e59b8e4e16cde\n",
      "2024-07-24 11:06:52 Model response: GenerationResponse(text=```json\n",
      "{\"entities\":[{\"label\":\"Airline\",\"attributes\":[{\"name\":\"name\",\"type\":\"string\",\"unique\":true,\"required\":true}]},{\"label\":\"Pet\",\"attributes\":[{\"name\":\"type\",\"type\":\"string\",\"unique\":true,\"required\":true},{\"name\":\"travel_method\",\"type\":\"string\",\"unique\":false,\"required\":false},{\"name\":\"health_status\",\"type\":\"string\",\"unique\":false,\"required\":false},{\"name\":\"route\",\"type\":\"string\",\"unique\":false,\"required\":false}]},{\"label\":\"HealthCertificate\",\"attributes\":[{\"name\":\"signed_by\",\"type\":\"string\",\"unique\":true,\"required\":true},{\"name\":\"fit_to_fly\",\"type\":\"boolean\",\"unique\":false,\"required\":false}]},{\"label\":\"PetContainer\",\"attributes\":[{\"name\":\"size\",\"type\":\"string\",\"unique\":true,\"required\":true},{\"name\":\"ventilation\",\"type\":\"string\",\"unique\":false,\"required\":false},{\"name\":\"design\",\"type\":\"string\",\"unique\":false,\"required\":false},{\"name\":\"strength\",\"type\":\"string\",\"unique\":false,\"required\":false}]},{\"label\":\"Nationality\",\"attributes\":[{\"name\":\"country\",\"type\":\"string\",\"unique\":true,\"required\":true}]},{\"label\":\"Document\",\"attributes\":[{\"name\":\"type\",\"type\":\"string\",\"unique\":true,\"required\":true},{\"name\":\"source\",\"type\":\"string\",\"unique\":false,\"required\":false},{\"name\":\"required\",\"type\":\"boolean\",\"unique\":false,\"required\":false}]},{\"label\":\"ServiceDog\",\"attributes\":[{\"name\":\"route\",\"type\":\"string\",\"unique\":true,\"required\":true},{\"name\":\"cabin_free_of_charge\",\"type\":\"boolean\",\"unique\":false,\"required\":false}]},{\"label\":\"Country\",\"attributes\":[{\"name\":\"name\",\"type\":\"string\",\"unique\":true,\"required\":true}]}],\"relations\":[{\"label\":\"ACCEPTS\",\"source\":{\"label\":\"Airline\"},\"target\":{\"label\":\"Pet\"}},{\"label\":\"HAS\",\"source\":{\"label\":\"Pet\"},\"target\":{\"label\":\"HealthCertificate\"}},{\"label\":\"REQUIRES\",\"source\":{\"label\":\"Airline\"},\"target\":{\"label\":\"Document\"}},{\"label\":\"USES\",\"source\":{\"label\":\"Pet\"},\"target\":{\"label\":\"PetContainer\"}},{\"label\":\"ALLOWS\",\"source\":{\"label\":\"Airline\"},\"target\":{\"label\":\"ServiceDog\"}},{\"label\":\"HAS_RESTRICTIONS\",\"source\":{\"label\":\"Airline\"},\"target\":{\"label\":\"Country\"}}]}\n",
      "```, finish_reason=STOP)\n",
      "2024-07-24 11:06:52 Fixed ontology: Entities:\n",
      "\f- (:Airline {name: \"string!*\"})\n",
      "- (:Pet {type: \"string*\", travel_method: \"string\", health_status: \"string\", route: \"string\"})\n",
      "- (:HealthCertificate {signed_by: \"string*\", fit_to_fly: \"boolean*\"})\n",
      "- (:PetContainer {size: \"string\", ventilation: \"string\", design: \"string\", strength: \"string\"})\n",
      "- (:Nationality {country: \"string!*\"})\n",
      "- (:Document {type: \"string*\", source: \"string\", required: \"boolean\"})\n",
      "- (:ServiceDog {route: \"string\", cabin_free_of_charge: \"boolean\"})\n",
      "- (:Country {name: \"string!*\"})\n",
      "\n",
      "Edges:\n",
      "\f- (:Airline)-[:ACCEPTS {}]->(:Pet)\n",
      "- (:Pet)-[:HAS {}]->(:HealthCertificate)\n",
      "- (:Airline)-[:REQUIRES {}]->(:Document)\n",
      "- (:Pet)-[:USES {}]->(:PetContainer)\n",
      "- (:Airline)-[:ALLOWS {}]->(:ServiceDog)\n",
      "- (:Airline)-[:HAS_RESTRICTIONS {}]->(:Country)\n",
      "2024-07-24 11:06:52 Query: MERGE (n:Airline {name: \"string!*\"}) RETURN n\n",
      "2024-07-24 11:06:52 Query: MERGE (n:Pet {type: \"string*\", travel_method: \"string\", health_status: \"string\", route: \"string\"}) RETURN n\n",
      "2024-07-24 11:06:52 Query: MERGE (n:HealthCertificate {signed_by: \"string*\", fit_to_fly: \"boolean*\"}) RETURN n\n",
      "2024-07-24 11:06:52 Query: MERGE (n:PetContainer {size: \"string\", ventilation: \"string\", design: \"string\", strength: \"string\"}) RETURN n\n",
      "2024-07-24 11:06:52 Query: MERGE (n:Nationality {country: \"string!*\"}) RETURN n\n",
      "2024-07-24 11:06:53 Query: MERGE (n:Document {type: \"string*\", source: \"string\", required: \"boolean\"}) RETURN n\n",
      "2024-07-24 11:06:53 Query: MERGE (n:ServiceDog {route: \"string\", cabin_free_of_charge: \"boolean\"}) RETURN n\n",
      "2024-07-24 11:06:53 Query: MERGE (n:Country {name: \"string!*\"}) RETURN n\n",
      "2024-07-24 11:06:53 Query: MATCH (s:Airline) MATCH (t:Pet) MERGE (s)-[r:ACCEPTS {}]->(t) RETURN r\n",
      "2024-07-24 11:06:53 Query: MATCH (s:Pet) MATCH (t:HealthCertificate) MERGE (s)-[r:HAS {}]->(t) RETURN r\n",
      "2024-07-24 11:06:53 Query: MATCH (s:Airline) MATCH (t:Document) MERGE (s)-[r:REQUIRES {}]->(t) RETURN r\n",
      "2024-07-24 11:06:53 Query: MATCH (s:Pet) MATCH (t:PetContainer) MERGE (s)-[r:USES {}]->(t) RETURN r\n",
      "2024-07-24 11:06:53 Query: MATCH (s:Airline) MATCH (t:ServiceDog) MERGE (s)-[r:ALLOWS {}]->(t) RETURN r\n",
      "2024-07-24 11:06:53 Query: MATCH (s:Airline) MATCH (t:Country) MERGE (s)-[r:HAS_RESTRICTIONS {}]->(t) RETURN r\n"
     ]
    }
   ],
   "source": [
    "boundaries = \"\"\"\n",
    "  The ontology should be pertinent only to the information about animals you can bring on board.\n",
    "\"\"\"\n",
    "\n",
    "ontology = Ontology.from_sources(sources, boundaries, model)\n",
    "\n",
    "falkordb = FalkorDB()\n",
    "ontology.save_to_graph(falkordb.select_graph(\"qatar_qa_ontology\"))\n",
    "\n",
    "# save to json\n",
    "with open(\"ontologies/qatar_qa_ontology.json\", \"w\") as f:\n",
    "    json.dump(ontology.to_json(), f, indent=2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "2024-07-24 11:10:28 Query: MERGE (n:Airline {name: \"string!*\"}) RETURN n\n",
      "2024-07-24 11:10:28 Query: MERGE (n:Pet {type: \"string!*\", travel_method: \"string\", health_status: \"string\", route: \"string\", max_per_cabin: \"string\", max_per_passenger: \"string\"}) RETURN n\n",
      "2024-07-24 11:10:28 Query: MERGE (n:HealthCertificate {type: \"string!*\", signed_by: \"string*\", fit_to_fly: \"boolean*\"}) RETURN n\n",
      "2024-07-24 11:10:28 Query: MERGE (n:PetContainer {type: \"string!*\", size: \"string\", ventilation: \"string\", design: \"string\", strength: \"string\"}) RETURN n\n",
      "2024-07-24 11:10:28 Query: MERGE (n:Nationality {country: \"string!*\"}) RETURN n\n",
      "2024-07-24 11:10:28 Query: MERGE (n:Document {type: \"string!*\", source: \"string\", required: \"boolean\"}) RETURN n\n",
      "2024-07-24 11:10:28 Query: MERGE (n:ServiceDog {name: \"string!*\", route: \"string\", cabin_free_of_charge: \"boolean\"}) RETURN n\n",
      "2024-07-24 11:10:28 Query: MERGE (n:Country {name: \"string!*\"}) RETURN n\n",
      "2024-07-24 11:10:28 Query: MERGE (n:TransferCare {details: \"string!*\"}) RETURN n\n",
      "2024-07-24 11:10:28 Query: MATCH (s:Airline) MATCH (t:Pet) MERGE (s)-[r:ACCEPTS {}]->(t) RETURN r\n",
      "2024-07-24 11:10:28 Query: MATCH (s:Pet) MATCH (t:HealthCertificate) MERGE (s)-[r:HAS {}]->(t) RETURN r\n",
      "2024-07-24 11:10:28 Query: MATCH (s:Airline) MATCH (t:Document) MERGE (s)-[r:REQUIRES {}]->(t) RETURN r\n",
      "2024-07-24 11:10:28 Query: MATCH (s:Pet) MATCH (t:PetContainer) MERGE (s)-[r:USES {}]->(t) RETURN r\n",
      "2024-07-24 11:10:28 Query: MATCH (s:Airline) MATCH (t:ServiceDog) MERGE (s)-[r:ALLOWS {}]->(t) RETURN r\n",
      "2024-07-24 11:10:28 Query: MATCH (s:Airline) MATCH (t:Country) MERGE (s)-[r:HAS_RESTRICTIONS {}]->(t) RETURN r\n",
      "2024-07-24 11:10:28 Query: MATCH (s:Pet) MATCH (t:TransferCare) MERGE (s)-[r:RECEIVES {}]->(t) RETURN r\n"
     ]
    }
   ],
   "source": [
    "# import ontology from json file\n",
    "with open(\"ontologies/qatar_qa_ontology.json\", \"r\", encoding=\"utf-8\") as file:\n",
    "    ontology = Ontology.from_json(json.load(file))\n",
    "\n",
    "falkordb = FalkorDB()\n",
    "ontology.save_to_graph(falkordb.select_graph(\"qatar_qa_ontology\"))\n",
    "\n",
    "kg = KnowledgeGraph(\n",
    "    name=\"qatar_qa\",\n",
    "    model_config=KnowledgeGraphModelConfig.with_model(model),\n",
    "    ontology=ontology,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "2024-07-24 11:10:30 load_ssl_context verify=True cert=None trust_env=True http2=False\n",
      "2024-07-24 11:10:30 load_verify_locations cafile='/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/certifi/cacert.pem'\n",
      "2024-07-24 11:10:30 Processing 1 documents\n",
      "2024-07-24 11:10:30 Processing task: extract_data_step_efb50aa5-d93e-473b-898b-5b1876a35207\n",
      "2024-07-24 11:10:30 Processing task: extract_data_step_efb50aa5-d93e-473b-898b-5b1876a35207\n",
      "2024-07-24 11:10:30 User message:  Extract all possible entities and relations from the text below. Use the ontology provided in the system prompt. Assign textual IDs whenever required. Use double quotes for string values. It's imperative that string values are properly escaped. All formats should be consistent, for example, dates should be in the format \"YYYY-MM-DD\". If needed, add the correct spacing for text fields, where the text is not properly formatted.  User instructions:   Extract only the information related to the airline's policies about animals. Try to be the most detailed when filling up the attributes.   Raw Text: We know how important your pets are to you, which is why we strive to extend our world-class service to your furry and feathered friends when they travel. Qatar Airways accepts domesticated dogs, cats and birds as checked baggage, either on your flight or on a separate one, in accordance with international air travel regulations. To ensure compliance with the regulations of all countries you will fly to, please let us know if you would like to travel with your pet at least 48 hours before departure.Travel regulations require you to make all necessary documentation for your pet available before travel. Such documents include their health certificate (signed by your veterinarian, indicating that the animal is fit to fly) and identification or pet passport.You can now fill in an online form to submit a request for carriage of pets using the link below.  Submit a request var ulTag = $(\".whitefontP\").find(\"ul\").addClass('bulleted-list');var logoTexColor = \"maroon\";if (logoTexColor == 'white') { $(\".whitefontP\").find(\"ul > li\").prepend('<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>');} else { $(\".whitefontP\").find(\"ul > li\").prepend('<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>');} Service dogs On certain routes, Qatar Airways allows service dogs in the passenger cabin, free of charge, to accompany a passenger with a disability. On all other routes, service dogs will be accepted free of charge as checked baggage within the aircraft hold.Not all countries allow service animals to arrive in the passenger cabin of the aircraft. Please contact us to verify any limitations that may exist for the countries in your itinerary.  Browse FAQs var ulTag = $(\".whitefontP\").find(\"ul\").addClass('bulleted-list');var logoTexColor = \"maroon\";if (logoTexColor == 'white') { $(\".whitefontP\").find(\"ul > li\").prepend('<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>');} else { $(\".whitefontP\").find(\"ul > li\").prepend('<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>');} Falcons You can carry one falcon in the Economy Class cabin of an aircraft, and a maximum of six falcons are permitted within the Economy Class cabin of any one aircraft (country regulations may apply). For your pet’s well-being, Qatar Airways reserves the right to refuse the transport of any animal if we find the container is too small. Travelling with pets as checked baggage Domesticated dogs, cats and birds are accepted as checked baggage provided that the animal is in good health and all transport requirements are met. Service dog(s) can be transported in the cabin free of charge when travelling on specific routes.If a falcon is transported as checked baggage and not in the cabin, travelling cost of animals as checked baggage will apply.For cost information, see our excess baggage page. var ulTag = $(\".whitefontP\").find(\"ul\").addClass('bulleted-list');var logoTexColor = \"maroon\";if (logoTexColor == 'white') { $(\".whitefontP\").find(\"ul > li\").prepend('<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>');} else { $(\".whitefontP\").find(\"ul > li\").prepend('<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>');} $(document).ready(function () { if ($(window).width() < 767) { $(\".content-container-list .slick-track\").find('li').removeClass(\"fade\"); } }); Pet containers Pet food Care during transfer Discover lable Pet containers Pet food Care during transfer Pet containers Your pet's travel container must be of an adequate size and be equipped with sufficient openings for ventilation. It must also be of suitable design and sufficient strength to prevent escape.There are also limits on including more than one pet per container. For your pet’s well-being, Qatar Airways reserves the right to refuse the transport of any animal if we find the container is too small. More information Pet food We recommend that you provide enough food and water for your pet’s journey in the travelling container or kennel, as you will not be able to access your pet during the journey.When preparing your food and water containers, consider the below:Food and water containers must be present and affixed within the shipping container with provision to fill it from the outside that does not require the opening of the shipping container.Water bottles or similar dispensers that are attached inside or outside the shipping container are not considered suitable for refilling. If food is not provided by the owner, our ground services staff in Doha will provide your pet with food every three to four hours (up to two hours before departure), while water is changed every hour (provided that the water container attached to the kennel can be refilled from the outside) on the ground between connecting flights. var ulTag = $(\".whitefontP\").find(\"ul\").addClass('bulleted-list');var logoTexColor = \"maroon\";if (logoTexColor == 'white') { $(\".whitefontP\").find(\"ul > li\").prepend('<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>');} else { $(\".whitefontP\").find(\"ul > li\").prepend('<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>');} Pet care during transfer in Doha We aim to give your animals the utmost care during their journey with us, including any time on the ground between connecting flights.  If your transfer time in Doha is more than 3 hours, our ground staff will make sure that:Animals are allowed out of their kennels to walk and stretch;Animals are observed for signs of sickness and stress;Kennels are cleaned;Dogs are walked;Animals are provided a larger, more comfortable kennel during transit.If your transfer time in Doha is less than 3 hours, including if your planned transit changes to less than 3 hours due to operational reasons, these services will not be provided. Rest assured, all animals are monitored by our ground staff in the dedicated holding area between connecting flights.  var ulTag = $(\".whitefontP\").find(\"ul\").addClass('bulleted-list');var logoTexColor = \"maroon\";if (logoTexColor == 'white') { $(\".whitefontP\").find(\"ul > li\").prepend('<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>');} else { $(\".whitefontP\").find(\"ul > li\").prepend('<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>');} Health, breed or age restrictions Qatar Airways does not permit transport of certain breeds of dogs and cats as these animals are normally susceptible to increased risk of heat stroke when exposed to stress or temperatures above 21°C (69.8°F). Learn more var ulTag = $(\".whitefontP\").find(\"ul\").addClass('bulleted-list');var logoTexColor = \"maroon\";if (logoTexColor == 'white') { $(\".whitefontP\").find(\"ul > li\").prepend('<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>');} else { $(\".whitefontP\").find(\"ul > li\").prepend('<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>');} Does your itinerary include other airlines? Qatar Airways does not accept transporting animals transferring from flights operated by other airlines. However, transporting animals from Qatar Airways to other airlines is permitted. If you plan to connect onwards after your Qatar Airways flight when travelling with your pet, you must ensure all the necessary arrangements are made with the carriers involved. var ulTag = $(\".whitefontP\").find(\"ul\").addClass('bulleted-list');var logoTexColor = \"maroon\";if (logoTexColor == 'white') { $(\".whitefontP\").find(\"ul > li\").prepend('<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>');} else { $(\".whitefontP\").find(\"ul > li\").prepend('<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>');} Travelling with our partners? Find more information here if your journey includes a flight with one of our partners. American Airlines British Airways Royal Air Maroc Restrictions on dogs from high risk countries into the U.S. and CanadaClosed Travelling to the United StatesThere is a temporary suspension for dogs arriving into the United States from countries that CDC considers high risk for dog rabies. This includes dogs that have been in any high-risk country during the previous 6 months.Dogs from high-risk countries may be brought into the U.S. only with CDC’s advance written approval (CDC Dog Import Permit) which must be provided at the time of requesting a dog either as a service animal or as checked baggage. View more information on the CDC website.Travelling to CanadaEffective 28 September 2022, commercial dogs from high-risk countries for dog rabies will no longer be permitted entry into Canada. Personal or assistance dogs originating from high-risk countries will continue to be permitted entry provided all import and documentation requirements are met. View more information on the Canadian Government's website.  var ulTag = $(\".whitefontP\").find(\"ul\").addClass('bulleted-list');var logoTexColor = \"maroon\";if (logoTexColor == 'white') { $(\".whitefontP\").find(\"ul > li\").prepend('<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>');} else { $(\".whitefontP\").find(\"ul > li\").prepend('<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>');} Restrictions on transporting animals to and from Australia or New ZealandClosed Due to local regulations, Qatar Airways only accepts animals travelling to or from Australia or New Zealand as Cargo.For further information travelling from Australia or New Zealand, please contact your nearest Qatar Airways Cargo office. When travelling to Australia, note that animals can only be transported through Melbourne (MEL). For further information, please contact Post Entry Quarantine Services at PEQservices@agriculture.gov.au or phone at 1800 900 090 or (61 3) 8318 6700 (from outside Australia)               var ulTag = $(\".whitefontP\").find(\"ul\").addClass('bulleted-list');var logoTexColor = \"maroon\";if (logoTexColor == 'white') { $(\".whitefontP\").find(\"ul > li\").prepend('<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>');} else { $(\".whitefontP\").find(\"ul > li\").prepend('<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>');} In addition, please refer to the 'Visa and other requirements' section here to view customs restrictions that may apply for your journey. var ulTag = $(\".whitefontP\").find(\"ul\").addClass('bulleted-list');var logoTexColor = \"maroon\";if (logoTexColor == 'white') { $(\".whitefontP\").find(\"ul > li\").prepend('<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>');} else { $(\".whitefontP\").find(\"ul > li\").prepend('<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>');} \n",
      "2024-07-24 11:10:30 Request options: {'method': 'post', 'url': '/chat/completions', 'files': None, 'json_data': {'messages': [{'role': 'system', 'content': '\\nYou are a top-tier assistant with the goal of extracting entities and relations from text for a graph database, using the provided ontology.\\nUse only the provided entities, relation, and attributes in the ontology.\\nMaintain Entity Consistency: When extracting entities, it\\'s vital to ensure consistency. If an entity, such as \"John Doe\", is mentioned multiple times in the text but is referred to by different names or pronouns (e.g., \"Joe\", \"he\"), always use the most complete identifier for that entity throughout the knowledge graph. In this example, use \"John Doe\" as the entity ID. Remember, the knowledge graph should be coherent and easily understandable, so maintaining consistency in entity references is crucial.\\nMaintain format consistency: Ensure that the format of the extracted data is consistent with the provided ontology and context, to facilitate queries. For example, dates should always be in the format \"YYYY-MM-DD\", names should be consistently spaced, and so on.\\nDo not use any other entities, relations, or attributes that are not provided in the ontology.\\nDo not include any explanations or apologies in your responses.\\nDo not respond to any questions that might ask anything else than data extraction.\\n\\nYour response should be in JSON format and should follow the schema provided below.\\nMake sure the output JSON is returned inline and with no spaces, so to save in the output tokens count.\\n\\nSchema:\\n```json\\n{\\n  \"$schema\": \"https://json-schema.org/draft/2019-09/schema\",\\n  \"$id\": \"http://example.com/example.json\",\\n  \"type\": \"object\",\\n  \"title\": \"Graph Schema\",\\n  \"required\": [\"entities\", \"relations\"],\\n  \"properties\": {\\n    \"entities\": {\\n      \"type\": \"array\",\\n      \"title\": \"The entities Schema\",\\n      \"items\": {\\n        \"type\": \"object\",\\n        \"title\": \"A Schema\",\\n        \"required\": [\"label\", \"attributes\"],\\n        \"properties\": {\\n          \"label\": {\\n            \"type\": \"string\",\\n            \"title\": \"The label Schema\",\\n            \"format\": \"titlecase\"\\n          },\\n          \"attributes\": {\\n            \"type\": \"object\",\\n            \"title\": \"The attributes Schema\"\\n          }\\n        }\\n      }\\n    },\\n    \"relations\": {\\n      \"type\": \"array\",\\n      \"title\": \"The relations Schema\",\\n      \"items\": {\\n        \"type\": \"object\",\\n        \"title\": \"A Schema\",\\n        \"required\": [\"label\", \"source\", \"target\"],\\n        \"properties\": {\\n          \"label\": {\\n            \"type\": \"string\",\\n            \"title\": \"The label Schema\",\\n            \"format\": \"uppercase\"\\n          },\\n          \"source\": {\\n            \"type\": \"object\",\\n            \"title\": \"The source Schema\",\\n            \"required\": [\"label\", \"attributes\"],\\n            \"properties\": {\\n              \"label\": {\\n                \"type\": \"string\",\\n                \"format\": \"titlecase\",\\n                \"title\": \"The label Schema\"\\n              },\\n              \"attributes\": {\\n                \"type\": \"object\",\\n                \"title\": \"The attributes Schema\"\\n              }\\n            }\\n          },\\n          \"target\": {\\n            \"type\": \"object\",\\n            \"title\": \"The target Schema\",\\n            \"required\": [\"label\", \"attributes\"],\\n            \"properties\": {\\n              \"label\": {\\n                \"type\": \"string\",\\n                \"format\": \"titlecase\",\\n                \"title\": \"The label Schema\"\\n              },\\n              \"attributes\": {\\n                \"type\": \"object\",\\n                \"title\": \"The attributes Schema\"\\n              }\\n            }\\n          },\\n          \"attributes\": {\\n            \"type\": \"object\",\\n            \"title\": \"The attributes Schema\"\\n          }\\n        }\\n      }\\n    }\\n  }\\n}\\n```\\n\\nFor example:\\n```{\"entities\":[{\"label\":\"Person\",\"attributes\":{\"name\":\"John Doe\",\"age\":30}},{\"label\":\"Movie\",\"attributes\":{\"title\":\"Inception\",\"releaseYear\":2010}}],\"relations\":[{\"label\":\"ACTED_IN\",\"source\":{\"label\":\"Person\",\"attributes\":{\"name\":\"JohnDoe\"}},\"target\":{\"label\":\"Movie\",\"attributes\":{\"title\":\"Inception\"}},\"attributes\":{\"role\":\"Cobb\"}}]}```\\n\\nOntology:\\n{\\'entities\\': [{\\'label\\': \\'Airline\\', \\'attributes\\': [{\\'name\\': \\'name\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}], \\'description\\': \\'\\'}, {\\'label\\': \\'Pet\\', \\'attributes\\': [{\\'name\\': \\'type\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'travel_method\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'health_status\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'route\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'max_per_cabin\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'max_per_passenger\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}], \\'description\\': \\'\\'}, {\\'label\\': \\'HealthCertificate\\', \\'attributes\\': [{\\'name\\': \\'type\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'signed_by\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': True}, {\\'name\\': \\'fit_to_fly\\', \\'type\\': \\'boolean\\', \\'unique\\': False, \\'required\\': True}], \\'description\\': \\'\\'}, {\\'label\\': \\'PetContainer\\', \\'attributes\\': [{\\'name\\': \\'type\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'size\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'ventilation\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'design\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'strength\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}], \\'description\\': \\'\\'}, {\\'label\\': \\'Nationality\\', \\'attributes\\': [{\\'name\\': \\'country\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}], \\'description\\': \\'\\'}, {\\'label\\': \\'Document\\', \\'attributes\\': [{\\'name\\': \\'type\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'source\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'required\\', \\'type\\': \\'boolean\\', \\'unique\\': False, \\'required\\': False}], \\'description\\': \\'\\'}, {\\'label\\': \\'ServiceDog\\', \\'attributes\\': [{\\'name\\': \\'name\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'route\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'cabin_free_of_charge\\', \\'type\\': \\'boolean\\', \\'unique\\': False, \\'required\\': False}], \\'description\\': \\'\\'}, {\\'label\\': \\'Country\\', \\'attributes\\': [{\\'name\\': \\'name\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}], \\'description\\': \\'\\'}, {\\'label\\': \\'TransferCare\\', \\'attributes\\': [{\\'name\\': \\'details\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}], \\'description\\': \\'\\'}], \\'relations\\': [{\\'label\\': \\'ACCEPTS\\', \\'source\\': {\\'label\\': \\'Airline\\'}, \\'target\\': {\\'label\\': \\'Pet\\'}, \\'attributes\\': []}, {\\'label\\': \\'HAS\\', \\'source\\': {\\'label\\': \\'Pet\\'}, \\'target\\': {\\'label\\': \\'HealthCertificate\\'}, \\'attributes\\': []}, {\\'label\\': \\'REQUIRES\\', \\'source\\': {\\'label\\': \\'Airline\\'}, \\'target\\': {\\'label\\': \\'Document\\'}, \\'attributes\\': []}, {\\'label\\': \\'USES\\', \\'source\\': {\\'label\\': \\'Pet\\'}, \\'target\\': {\\'label\\': \\'PetContainer\\'}, \\'attributes\\': []}, {\\'label\\': \\'ALLOWS\\', \\'source\\': {\\'label\\': \\'Airline\\'}, \\'target\\': {\\'label\\': \\'ServiceDog\\'}, \\'attributes\\': []}, {\\'label\\': \\'HAS_RESTRICTIONS\\', \\'source\\': {\\'label\\': \\'Airline\\'}, \\'target\\': {\\'label\\': \\'Country\\'}, \\'attributes\\': []}, {\\'label\\': \\'RECEIVES\\', \\'source\\': {\\'label\\': \\'Pet\\'}, \\'target\\': {\\'label\\': \\'TransferCare\\'}, \\'attributes\\': []}]}\\n'}, {'role': 'user', 'content': '\\nExtract all possible entities and relations from the text below.\\nUse the ontology provided in the system prompt.\\nAssign textual IDs whenever required.\\nUse double quotes for string values.\\nIt\\'s imperative that string values are properly escaped.\\nAll formats should be consistent, for example, dates should be in the format \"YYYY-MM-DD\".\\nIf needed, add the correct spacing for text fields, where the text is not properly formatted.\\n\\nUser instructions:\\n\\n\\nExtract only the information related to the airline\\'s policies about animals.\\nTry to be the most detailed when filling up the attributes.\\n\\n\\nRaw Text:\\nWe know how important your pets are to you, which is why we strive to extend our world-class service to your furry and feathered friends when they travel. Qatar Airways accepts domesticated dogs, cats and birds as checked baggage, either on your flight or on a separate one, in accordance with international air travel regulations.\\xa0To ensure compliance with the regulations of all countries you will fly to, please let us know if you would like to travel with your pet at least 48 hours before departure.Travel regulations require you to make all necessary documentation for your pet available before travel. Such documents include their health certificate (signed by your veterinarian, indicating that the animal is fit to fly) and identification or pet passport.You can now fill in an online form to submit a request for carriage of pets using the link below.\\xa0 Submit a request var ulTag = $(\".whitefontP\").find(\"ul\").addClass(\\'bulleted-list\\');var logoTexColor = \"maroon\";if (logoTexColor == \\'white\\') { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>\\');} else { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>\\');} Service dogs On certain routes, Qatar Airways allows service dogs in the passenger cabin, free of charge, to accompany a passenger with a disability. On all other routes, service dogs will be accepted free of charge as checked baggage within the aircraft hold.Not all countries allow service animals to arrive in the passenger cabin of the aircraft. Please contact us to verify any limitations that may exist for the countries in your itinerary.\\xa0 Browse FAQs var ulTag = $(\".whitefontP\").find(\"ul\").addClass(\\'bulleted-list\\');var logoTexColor = \"maroon\";if (logoTexColor == \\'white\\') { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>\\');} else { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>\\');} Falcons You can carry one falcon in the Economy Class cabin of an aircraft, and a maximum of six falcons are permitted within the Economy Class cabin of any one aircraft (country regulations may apply).\\xa0For your pet’s well-being, Qatar Airways reserves the right to refuse the transport of any animal if we find the container is too small. Travelling with pets as checked baggage Domesticated dogs, cats and birds are accepted as checked baggage provided that the animal is in good health and all transport requirements are met.\\xa0Service dog(s) can be transported in the cabin free of charge when travelling on specific routes.If a falcon is transported as checked baggage and not in the cabin, travelling cost of animals as checked baggage will apply.For cost information, see our excess baggage page. var ulTag = $(\".whitefontP\").find(\"ul\").addClass(\\'bulleted-list\\');var logoTexColor = \"maroon\";if (logoTexColor == \\'white\\') { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>\\');} else { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>\\');} $(document).ready(function () { if ($(window).width() < 767) { $(\".content-container-list .slick-track\").find(\\'li\\').removeClass(\"fade\"); } }); Pet containers Pet food Care during transfer Discover lable Pet containers Pet food Care during transfer Pet containers Your pet\\'s travel container must be of an adequate size and be equipped with sufficient openings for ventilation. It must also be of suitable design and sufficient strength to prevent escape.There are also limits on including more than one pet per container.\\xa0For your pet’s well-being, Qatar Airways reserves the right to refuse the transport of any animal if we find the container is too small. More information Pet food We recommend\\xa0that you provide enough food and water for your pet’s journey in the travelling container or kennel, as you will not be able to access your pet during the journey.When preparing your food and water containers, consider the below:Food and water containers must be present and affixed within the shipping container with provision to fill it from the outside that does not require the opening of the shipping container.Water bottles or similar dispensers that are attached inside or outside the shipping container are not considered suitable for refilling.\\xa0If food is not provided by the owner, our ground services staff in Doha will provide your pet with food every three to four hours (up to two hours before departure), while water is changed every hour (provided that the water container attached to the kennel can be refilled from the outside) on the ground between connecting flights. var ulTag = $(\".whitefontP\").find(\"ul\").addClass(\\'bulleted-list\\');var logoTexColor = \"maroon\";if (logoTexColor == \\'white\\') { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>\\');} else { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>\\');} Pet care during transfer in Doha We aim to give your animals the utmost care during their journey with us, including any time on the ground between connecting flights.\\xa0\\xa0If your transfer time in Doha is more than 3 hours, our ground staff will make sure that:Animals are allowed out of their kennels to walk and stretch;Animals are observed for signs of sickness and stress;Kennels are cleaned;Dogs are walked;Animals are provided a larger, more comfortable kennel during transit.If your transfer time in Doha is less than 3 hours, including if your planned transit changes to less than 3 hours due to operational reasons, these services will not be provided. Rest assured, all animals are\\xa0monitored by our ground staff in the dedicated holding area between connecting flights.\\xa0 var ulTag = $(\".whitefontP\").find(\"ul\").addClass(\\'bulleted-list\\');var logoTexColor = \"maroon\";if (logoTexColor == \\'white\\') { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>\\');} else { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>\\');} Health, breed or age restrictions Qatar Airways does not permit transport of certain breeds of dogs and cats as these animals are normally susceptible to increased risk of heat stroke when exposed to stress or temperatures above 21°C (69.8°F). Learn more var ulTag = $(\".whitefontP\").find(\"ul\").addClass(\\'bulleted-list\\');var logoTexColor = \"maroon\";if (logoTexColor == \\'white\\') { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>\\');} else { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>\\');} Does your itinerary include other airlines? Qatar Airways does not accept transporting animals transferring from flights operated by other airlines. However, transporting animals from Qatar Airways to other airlines is permitted.\\xa0If you plan to connect onwards after your Qatar Airways flight when travelling with your pet, you must ensure all the necessary arrangements are made with the carriers involved. var ulTag = $(\".whitefontP\").find(\"ul\").addClass(\\'bulleted-list\\');var logoTexColor = \"maroon\";if (logoTexColor == \\'white\\') { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>\\');} else { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>\\');} Travelling with our partners? Find more information here if your journey includes a flight with one of our partners. American Airlines British Airways Royal Air Maroc Restrictions on dogs from high risk countries into the U.S. and CanadaClosed Travelling to the United StatesThere is a temporary suspension for dogs arriving into the United States from countries that CDC considers high risk for dog rabies. This includes dogs that have been in any high-risk country during the previous 6 months.Dogs from high-risk countries may be brought into the U.S. only with CDC’s advance written approval (CDC Dog Import Permit) which must be provided at the time of requesting a dog either as a service animal or as checked baggage.\\xa0View more information on the\\xa0CDC website.Travelling to CanadaEffective 28 September 2022, commercial dogs from high-risk countries for dog rabies will no longer be permitted entry into Canada. Personal or assistance dogs originating from high-risk countries will continue to be permitted entry provided all import and documentation requirements are met. View more information on the Canadian Government\\'s website.\\xa0 var ulTag = $(\".whitefontP\").find(\"ul\").addClass(\\'bulleted-list\\');var logoTexColor = \"maroon\";if (logoTexColor == \\'white\\') { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>\\');} else { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>\\');} Restrictions on transporting animals to and from Australia or New ZealandClosed Due to local regulations, Qatar Airways only accepts animals travelling to or from Australia or New Zealand as Cargo.For further information travelling from Australia or New Zealand, please contact your nearest\\xa0Qatar Airways Cargo office.\\xa0When travelling to Australia, note that animals can only be transported through Melbourne (MEL). For further information, please contact Post Entry Quarantine Services at PEQservices@agriculture.gov.au or phone at 1800 900 090 or (61 3) 8318 6700 (from outside Australia)\\xa0 \\xa0 \\xa0 \\xa0 \\xa0 \\xa0 \\xa0\\xa0 var ulTag = $(\".whitefontP\").find(\"ul\").addClass(\\'bulleted-list\\');var logoTexColor = \"maroon\";if (logoTexColor == \\'white\\') { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>\\');} else { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>\\');} In addition, please refer to the \\'Visa and other requirements\\' section here to view customs restrictions that may apply for your journey. var ulTag = $(\".whitefontP\").find(\"ul\").addClass(\\'bulleted-list\\');var logoTexColor = \"maroon\";if (logoTexColor == \\'white\\') { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl qtr-txt-white\"></span>\\');} else { $(\".whitefontP\").find(\"ul > li\").prepend(\\'<span class=\"icon-arrow-strong icon-rotate-rtl\"></span>\\');}\\n'}], 'model': 'gpt-4o', 'max_tokens': None, 'stop': None, 'temperature': None, 'top_p': None}}\n",
      "2024-07-24 11:10:30 Sending HTTP Request: POST https://api.openai.com/v1/chat/completions\n",
      "2024-07-24 11:10:30 connect_tcp.started host='api.openai.com' port=443 local_address=None timeout=5.0 socket_options=None\n",
      "2024-07-24 11:10:30 connect_tcp.complete return_value=<httpcore._backends.sync.SyncStream object at 0x11c46bc10>\n",
      "2024-07-24 11:10:30 start_tls.started ssl_context=<ssl.SSLContext object at 0x11fb251c0> server_hostname='api.openai.com' timeout=5.0\n",
      "2024-07-24 11:10:30 start_tls.complete return_value=<httpcore._backends.sync.SyncStream object at 0x11fd08810>\n",
      "2024-07-24 11:10:30 send_request_headers.started request=<Request [b'POST']>\n",
      "2024-07-24 11:10:30 send_request_headers.complete\n",
      "2024-07-24 11:10:30 send_request_body.started request=<Request [b'POST']>\n",
      "2024-07-24 11:10:30 send_request_body.complete\n",
      "2024-07-24 11:10:30 receive_response_headers.started request=<Request [b'POST']>\n",
      "2024-07-24 11:10:41 receive_response_headers.complete return_value=(b'HTTP/1.1', 200, b'OK', [(b'Date', b'Thu, 11 Jul 2024 08:10:41 GMT'), (b'Content-Type', b'application/json'), (b'Transfer-Encoding', b'chunked'), (b'Connection', b'keep-alive'), (b'openai-organization', b'falkordb'), (b'openai-processing-ms', b'10391'), (b'openai-version', b'2020-10-01'), (b'strict-transport-security', b'max-age=31536000; includeSubDomains'), (b'x-ratelimit-limit-requests', b'10000'), (b'x-ratelimit-limit-tokens', b'22000000'), (b'x-ratelimit-remaining-requests', b'9999'), (b'x-ratelimit-remaining-tokens', b'21995406'), (b'x-ratelimit-reset-requests', b'6ms'), (b'x-ratelimit-reset-tokens', b'12ms'), (b'x-request-id', b'req_cdd69c0be1a01f9c97b8b4ba7cde8f8b'), (b'CF-Cache-Status', b'DYNAMIC'), (b'Set-Cookie', b'__cf_bm=PsBaEuWJh3wFFz5RjNBhvVX6aH36.9Nbi6hXU_iLgAk-1720685441-1.0.1.1-PT90RMRVF8uIbK8Tzr9.gVpa5UyTTJR18LrpbR3_gHmBvKkHrBs64GV5ydYfQd4MVPkeyAdNCnwknX2fGn45JQ; path=/; expires=Thu, 11-Jul-24 08:40:41 GMT; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), (b'Set-Cookie', b'_cfuvid=xi8MJskx9rgjn7_qkB4Bp5pzylr1gQ_t3xyy78hk5fw-1720685441898-0.0.1.1-604800000; path=/; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), (b'Server', b'cloudflare'), (b'CF-RAY', b'8a1751487faa59dd-MXP'), (b'Content-Encoding', b'gzip'), (b'alt-svc', b'h3=\":443\"; ma=86400')])\n",
      "2024-07-24 11:10:41 HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "2024-07-24 11:10:41 receive_response_body.started request=<Request [b'POST']>\n",
      "2024-07-24 11:10:41 receive_response_body.complete\n",
      "2024-07-24 11:10:41 response_closed.started\n",
      "2024-07-24 11:10:41 response_closed.complete\n",
      "2024-07-24 11:10:41 HTTP Response: POST https://api.openai.com/v1/chat/completions \"200 OK\" Headers([('date', 'Thu, 11 Jul 2024 08:10:41 GMT'), ('content-type', 'application/json'), ('transfer-encoding', 'chunked'), ('connection', 'keep-alive'), ('openai-organization', 'falkordb'), ('openai-processing-ms', '10391'), ('openai-version', '2020-10-01'), ('strict-transport-security', 'max-age=31536000; includeSubDomains'), ('x-ratelimit-limit-requests', '10000'), ('x-ratelimit-limit-tokens', '22000000'), ('x-ratelimit-remaining-requests', '9999'), ('x-ratelimit-remaining-tokens', '21995406'), ('x-ratelimit-reset-requests', '6ms'), ('x-ratelimit-reset-tokens', '12ms'), ('x-request-id', 'req_cdd69c0be1a01f9c97b8b4ba7cde8f8b'), ('cf-cache-status', 'DYNAMIC'), ('set-cookie', '__cf_bm=PsBaEuWJh3wFFz5RjNBhvVX6aH36.9Nbi6hXU_iLgAk-1720685441-1.0.1.1-PT90RMRVF8uIbK8Tzr9.gVpa5UyTTJR18LrpbR3_gHmBvKkHrBs64GV5ydYfQd4MVPkeyAdNCnwknX2fGn45JQ; path=/; expires=Thu, 11-Jul-24 08:40:41 GMT; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), ('set-cookie', '_cfuvid=xi8MJskx9rgjn7_qkB4Bp5pzylr1gQ_t3xyy78hk5fw-1720685441898-0.0.1.1-604800000; path=/; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), ('server', 'cloudflare'), ('cf-ray', '8a1751487faa59dd-MXP'), ('content-encoding', 'gzip'), ('alt-svc', 'h3=\":443\"; ma=86400')])\n",
      "2024-07-24 11:10:41 request_id: req_cdd69c0be1a01f9c97b8b4ba7cde8f8b\n",
      "2024-07-24 11:10:41 Model response: ```json\n",
      "{\"entities\":[{\"label\":\"Airline\",\"attributes\":{\"name\":\"Qatar Airways\"}},{\"label\":\"Pet\",\"attributes\":{\"type\":\"Dog\"}},{\"label\":\"Pet\",\"attributes\":{\"type\":\"Cat\"}},{\"label\":\"Pet\",\"attributes\":{\"type\":\"Bird\"}},{\"label\":\"Pet\",\"attributes\":{\"type\":\"Falcon\",\"max_per_cabin\":\"6\"}},{\"label\":\"PetContainer\",\"attributes\":{\"type\":\"Travel Container\",\"ventilation\":\"Sufficient openings for ventilation\",\"design\":\"Suitable\",\"strength\":\"Sufficient to prevent escape\"}},{\"label\":\"ServiceDog\",\"attributes\":{\"name\":\"Service Dog\",\"cabin_free_of_charge\":true}},{\"label\":\"Document\",\"attributes\":{\"type\":\"Health Certificate\",\"required\":true}},{\"label\":\"TransferCare\",\"attributes\":{\"details\":\"Pets will be cared for, walked, and monitored if the transfer in Doha exceeds 3 hours\"}}],\"relations\":[{\"label\":\"ACCEPTS\",\"source\":{\"label\":\"Airline\",\"attributes\":{\"name\":\"Qatar Airways\"}},\"target\":{\"label\":\"Pet\",\"attributes\":{\"type\":\"Dog\"}}},{\"label\":\"ACCEPTS\",\"source\":{\"label\":\"Airline\",\"attributes\":{\"name\":\"Qatar Airways\"}},\"target\":{\"label\":\"Pet\",\"attributes\":{\"type\":\"Cat\"}}},{\"label\":\"ACCEPTS\",\"source\":{\"label\":\"Airline\",\"attributes\":{\"name\":\"Qatar Airways\"}},\"target\":{\"label\":\"Pet\",\"attributes\":{\"type\":\"Bird\"}}},{\"label\":\"ACCEPTS\",\"source\":{\"label\":\"Airline\",\"attributes\":{\"name\":\"Qatar Airways\"}},\"target\":{\"label\":\"Pet\",\"attributes\":{\"type\":\"Falcon\"}}},{\"label\":\"ALLOWS\",\"source\":{\"label\":\"Airline\",\"attributes\":{\"name\":\"Qatar Airways\"}},\"target\":{\"label\":\"ServiceDog\",\"attributes\":{\"name\":\"Service Dog\"}}},{\"label\":\"REQUIRES\",\"source\":{\"label\":\"Airline\",\"attributes\":{\"name\":\"Qatar Airways\"}},\"target\":{\"label\":\"Document\",\"attributes\":{\"type\":\"Health Certificate\"}}},{\"label\":\"USES\",\"source\":{\"label\":\"Pet\",\"attributes\":{\"type\":\"Dog\"}},\"target\":{\"label\":\"PetContainer\",\"attributes\":{\"type\":\"Travel Container\"}}},{\"label\":\"USES\",\"source\":{\"label\":\"Pet\",\"attributes\":{\"type\":\"Cat\"}},\"target\":{\"label\":\"PetContainer\",\"attributes\":{\"type\":\"Travel Container\"}}},{\"label\":\"USES\",\"source\":{\"label\":\"Pet\",\"attributes\":{\"type\":\"Bird\"}},\"target\":{\"label\":\"PetContainer\",\"attributes\":{\"type\":\"Travel Container\"}}},{\"label\":\"USES\",\"source\":{\"label\":\"Pet\",\"attributes\":{\"type\":\"Falcon\"}},\"target\":{\"label\":\"PetContainer\",\"attributes\":{\"type\":\"Travel Container\"}}},{\"label\":\"RECEIVES\",\"source\":{\"label\":\"Pet\",\"attributes\":{\"type\":\"Dog\"}},\"target\":{\"label\":\"TransferCare\",\"attributes\":{\"details\":\"Pets will be cared for, walked, and monitored if the transfer in Doha exceeds 3 hours\"}}},{\"label\":\"RECEIVES\",\"source\":{\"label\":\"Pet\",\"attributes\":{\"type\":\"Cat\"}},\"target\":{\"label\":\"TransferCare\",\"attributes\":{\"details\":\"Pets will be cared for, walked, and monitored if the transfer in Doha exceeds 3 hours\"}}},{\"label\":\"RECEIVES\",\"source\":{\"label\":\"Pet\",\"attributes\":{\"type\":\"Bird\"}},\"target\":{\"label\":\"TransferCare\",\"attributes\":{\"details\":\"Pets will be cared for, walked, and monitored if the transfer in Doha exceeds 3 hours\"}}},{\"label\":\"RECEIVES\",\"source\":{\"label\":\"Pet\",\"attributes\":{\"type\":\"Falcon\"}},\"target\":{\"label\":\"TransferCare\",\"attributes\":{\"details\":\"Pets will be cared for, walked, and monitored if the transfer in Doha exceeds 3 hours\"}}}]}\n",
      "```\n",
      "2024-07-24 11:10:41 Query: MERGE (n:Airline {name: \"Qatar Airways\"}) \n",
      "2024-07-24 11:10:41 Query: MERGE (n:Pet {type: \"Dog\"}) \n",
      "2024-07-24 11:10:41 Query: MERGE (n:Pet {type: \"Cat\"}) \n",
      "2024-07-24 11:10:41 Query: MERGE (n:Pet {type: \"Bird\"}) \n",
      "2024-07-24 11:10:41 Query: MERGE (n:Pet {type: \"Falcon\"}) SET n += {max_per_cabin: \"6\"}\n",
      "2024-07-24 11:10:41 Query: MERGE (n:PetContainer {type: \"Travel Container\"}) SET n += {ventilation: \"Sufficient openings for ventilation\", design: \"Suitable\", strength: \"Sufficient to prevent escape\"}\n",
      "2024-07-24 11:10:41 Query: MERGE (n:ServiceDog {name: \"Service Dog\"}) SET n += {cabin_free_of_charge: True}\n",
      "2024-07-24 11:10:41 Query: MERGE (n:Document {type: \"Health Certificate\"}) SET n += {required: True}\n",
      "2024-07-24 11:10:41 Query: MERGE (n:TransferCare {details: \"Pets will be cared for, walked, and monitored if the transfer in Doha exceeds 3 hours\"}) \n",
      "2024-07-24 11:10:41 Query: MATCH (s:Airline {name: \"Qatar Airways\"}) MATCH (d:Pet {type: \"Dog\"}) MERGE (s)-[r:ACCEPTS]->(d) \n",
      "2024-07-24 11:10:41 Query: MATCH (s:Airline {name: \"Qatar Airways\"}) MATCH (d:Pet {type: \"Cat\"}) MERGE (s)-[r:ACCEPTS]->(d) \n",
      "2024-07-24 11:10:41 Query: MATCH (s:Airline {name: \"Qatar Airways\"}) MATCH (d:Pet {type: \"Bird\"}) MERGE (s)-[r:ACCEPTS]->(d) \n",
      "2024-07-24 11:10:41 Query: MATCH (s:Airline {name: \"Qatar Airways\"}) MATCH (d:Pet {type: \"Falcon\"}) MERGE (s)-[r:ACCEPTS]->(d) \n",
      "2024-07-24 11:10:41 Query: MATCH (s:Airline {name: \"Qatar Airways\"}) MATCH (d:ServiceDog {name: \"Service Dog\"}) MERGE (s)-[r:ALLOWS]->(d) \n",
      "2024-07-24 11:10:41 Query: MATCH (s:Airline {name: \"Qatar Airways\"}) MATCH (d:Document {type: \"Health Certificate\"}) MERGE (s)-[r:REQUIRES]->(d) \n",
      "2024-07-24 11:10:41 Query: MATCH (s:Pet {type: \"Dog\"}) MATCH (d:PetContainer {type: \"Travel Container\"}) MERGE (s)-[r:USES]->(d) \n",
      "2024-07-24 11:10:41 Query: MATCH (s:Pet {type: \"Cat\"}) MATCH (d:PetContainer {type: \"Travel Container\"}) MERGE (s)-[r:USES]->(d) \n",
      "2024-07-24 11:10:41 Query: MATCH (s:Pet {type: \"Bird\"}) MATCH (d:PetContainer {type: \"Travel Container\"}) MERGE (s)-[r:USES]->(d) \n",
      "2024-07-24 11:10:41 Query: MATCH (s:Pet {type: \"Falcon\"}) MATCH (d:PetContainer {type: \"Travel Container\"}) MERGE (s)-[r:USES]->(d) \n",
      "2024-07-24 11:10:41 Query: MATCH (s:Pet {type: \"Dog\"}) MATCH (d:TransferCare {details: \"Pets will be cared for, walked, and monitored if the transfer in Doha exceeds 3 hours\"}) MERGE (s)-[r:RECEIVES]->(d) \n",
      "2024-07-24 11:10:41 Query: MATCH (s:Pet {type: \"Cat\"}) MATCH (d:TransferCare {details: \"Pets will be cared for, walked, and monitored if the transfer in Doha exceeds 3 hours\"}) MERGE (s)-[r:RECEIVES]->(d) \n",
      "2024-07-24 11:10:41 Query: MATCH (s:Pet {type: \"Bird\"}) MATCH (d:TransferCare {details: \"Pets will be cared for, walked, and monitored if the transfer in Doha exceeds 3 hours\"}) MERGE (s)-[r:RECEIVES]->(d) \n",
      "2024-07-24 11:10:41 Query: MATCH (s:Pet {type: \"Falcon\"}) MATCH (d:TransferCare {details: \"Pets will be cared for, walked, and monitored if the transfer in Doha exceeds 3 hours\"}) MERGE (s)-[r:RECEIVES]->(d) \n"
     ]
    }
   ],
   "source": [
    "kg.process_sources(sources, instructions=\"\"\"\n",
    "Extract only the information related to the airline's policies about animals.\n",
    "Try to be the most detailed when filling up the attributes.\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "2024-07-24 11:10:48 load_ssl_context verify=True cert=None trust_env=True http2=False\n",
      "2024-07-24 11:10:48 load_verify_locations cafile='/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/certifi/cacert.pem'\n",
      "2024-07-24 11:10:48 Cypher Prompt: \n",
      "Using the ontology provided, generate an OpenCypher statement to query the graph database returning all relevant entities, relationships, and attributes to answer the question below:\n",
      "If you cannot generate a OpenCypher statement for any reason, return an empty string.\n",
      "Respect the order of the relationships, the arrows should always point from the \"source\" to the \"target\".\n",
      "\n",
      "Question: Can I take my dog with me on board?\n",
      "\n",
      "2024-07-24 11:10:48 Request options: {'method': 'post', 'url': '/chat/completions', 'files': None, 'json_data': {'messages': [{'role': 'system', 'content': '\\nTask: Generate OpenCypher statement to query a graph database.\\n\\nInstructions:\\nUse only the provided entities, relationships types and properties in the ontology.\\nThe output must be only a valid OpenCypher statement.\\nRespect the order of the relationships, the arrows should always point from the \"start\" to the \"end\".\\nRespect the types of entities of every relationship, according to the ontology.\\nThe OpenCypher statement must return all the relevant entities, not just the attributes requested.\\nThe output of the OpenCypher statement will be passed to another model to answer the question, hence, make sure the OpenCypher statement returns all relevant entities, relationships, and attributes.\\nIf the answer required multiple entities, return all the entities, relations, relationships, and their attributes.\\nIf you cannot generate a OpenCypher statement based on the provided ontology, explain the reason to the user.\\nFor String comparison, use the `CONTAINS` operator.\\nDo not use any other relationship types or properties that are not provided.\\nDo not respond to any questions that might ask anything else than for you to construct a OpenCypher statement.\\nDo not include any text except the generated OpenCypher statement, enclosed in triple backticks.\\nDo not include any explanations or apologies in your responses.\\nDo not return just the attributes requested in the question, but all related entities, relations, relationships, and attributes.\\nDo not change the order of the relationships, the arrows should always point from the \"start\" to the \"end\".\\n\\nThe following instructions describe extra functions that can be used in the OpenCypher statement:\\n\\nMatch: Describes relationships between entities using ASCII art patterns. Entities are represented by parentheses and relationships by brackets. Both can have aliases and labels.\\nVariable length relationships: Find entities a variable number of hops away using -[:TYPE*minHops..maxHops]->.\\nBidirectional path traversal: Specify relationship direction or omit it for either direction.\\nNamed paths: Assign a path in a MATCH clause to a single alias for future use.\\nShortest paths: Find all shortest paths between two entities using allShortestPaths().\\nSingle-Pair minimal-weight paths: Find minimal-weight paths between a pair of entities using algo.SPpaths().\\nSingle-Source minimal-weight paths: Find minimal-weight paths from a given source entity using algo.SSpaths().\\n\\nOntology:\\n{\\'entities\\': [{\\'label\\': \\'Airline\\', \\'attributes\\': [{\\'name\\': \\'name\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}], \\'description\\': \\'\\'}, {\\'label\\': \\'Pet\\', \\'attributes\\': [{\\'name\\': \\'type\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'travel_method\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'health_status\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'route\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'max_per_cabin\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'max_per_passenger\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}], \\'description\\': \\'\\'}, {\\'label\\': \\'HealthCertificate\\', \\'attributes\\': [{\\'name\\': \\'type\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'signed_by\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': True}, {\\'name\\': \\'fit_to_fly\\', \\'type\\': \\'boolean\\', \\'unique\\': False, \\'required\\': True}], \\'description\\': \\'\\'}, {\\'label\\': \\'PetContainer\\', \\'attributes\\': [{\\'name\\': \\'type\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'size\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'ventilation\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'design\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'strength\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}], \\'description\\': \\'\\'}, {\\'label\\': \\'Nationality\\', \\'attributes\\': [{\\'name\\': \\'country\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}], \\'description\\': \\'\\'}, {\\'label\\': \\'Document\\', \\'attributes\\': [{\\'name\\': \\'type\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'source\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'required\\', \\'type\\': \\'boolean\\', \\'unique\\': False, \\'required\\': False}], \\'description\\': \\'\\'}, {\\'label\\': \\'ServiceDog\\', \\'attributes\\': [{\\'name\\': \\'name\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'route\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'cabin_free_of_charge\\', \\'type\\': \\'boolean\\', \\'unique\\': False, \\'required\\': False}], \\'description\\': \\'\\'}, {\\'label\\': \\'Country\\', \\'attributes\\': [{\\'name\\': \\'name\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}], \\'description\\': \\'\\'}, {\\'label\\': \\'TransferCare\\', \\'attributes\\': [{\\'name\\': \\'details\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}], \\'description\\': \\'\\'}], \\'relations\\': [{\\'label\\': \\'ACCEPTS\\', \\'source\\': {\\'label\\': \\'Airline\\'}, \\'target\\': {\\'label\\': \\'Pet\\'}, \\'attributes\\': []}, {\\'label\\': \\'HAS\\', \\'source\\': {\\'label\\': \\'Pet\\'}, \\'target\\': {\\'label\\': \\'HealthCertificate\\'}, \\'attributes\\': []}, {\\'label\\': \\'REQUIRES\\', \\'source\\': {\\'label\\': \\'Airline\\'}, \\'target\\': {\\'label\\': \\'Document\\'}, \\'attributes\\': []}, {\\'label\\': \\'USES\\', \\'source\\': {\\'label\\': \\'Pet\\'}, \\'target\\': {\\'label\\': \\'PetContainer\\'}, \\'attributes\\': []}, {\\'label\\': \\'ALLOWS\\', \\'source\\': {\\'label\\': \\'Airline\\'}, \\'target\\': {\\'label\\': \\'ServiceDog\\'}, \\'attributes\\': []}, {\\'label\\': \\'HAS_RESTRICTIONS\\', \\'source\\': {\\'label\\': \\'Airline\\'}, \\'target\\': {\\'label\\': \\'Country\\'}, \\'attributes\\': []}, {\\'label\\': \\'RECEIVES\\', \\'source\\': {\\'label\\': \\'Pet\\'}, \\'target\\': {\\'label\\': \\'TransferCare\\'}, \\'attributes\\': []}]}\\n\\n\\nFor example, given the question \"Which managers own Neo4j stocks?\", the OpenCypher statement should look like this:\\n```\\nMATCH (m:Manager)-[:OWNS]->(s:Stock)\\nWHERE s.name CONTAINS \\'Neo4j\\'\\nRETURN m, s\\n```\\n'}, {'role': 'user', 'content': '\\nUsing the ontology provided, generate an OpenCypher statement to query the graph database returning all relevant entities, relationships, and attributes to answer the question below:\\nIf you cannot generate a OpenCypher statement for any reason, return an empty string.\\nRespect the order of the relationships, the arrows should always point from the \"source\" to the \"target\".\\n\\nQuestion: Can I take my dog with me on board?\\n'}], 'model': 'gpt-4o', 'max_tokens': None, 'stop': None, 'temperature': None, 'top_p': None}}\n",
      "2024-07-24 11:10:48 Sending HTTP Request: POST https://api.openai.com/v1/chat/completions\n",
      "2024-07-24 11:10:48 connect_tcp.started host='api.openai.com' port=443 local_address=None timeout=5.0 socket_options=None\n",
      "2024-07-24 11:10:48 connect_tcp.complete return_value=<httpcore._backends.sync.SyncStream object at 0x11fd4afd0>\n",
      "2024-07-24 11:10:48 start_tls.started ssl_context=<ssl.SSLContext object at 0x10556a210> server_hostname='api.openai.com' timeout=5.0\n",
      "2024-07-24 11:10:48 start_tls.complete return_value=<httpcore._backends.sync.SyncStream object at 0x11fd3f090>\n",
      "2024-07-24 11:10:48 send_request_headers.started request=<Request [b'POST']>\n",
      "2024-07-24 11:10:48 send_request_headers.complete\n",
      "2024-07-24 11:10:48 send_request_body.started request=<Request [b'POST']>\n",
      "2024-07-24 11:10:48 send_request_body.complete\n",
      "2024-07-24 11:10:48 receive_response_headers.started request=<Request [b'POST']>\n",
      "2024-07-24 11:10:50 receive_response_headers.complete return_value=(b'HTTP/1.1', 200, b'OK', [(b'Date', b'Thu, 11 Jul 2024 08:10:50 GMT'), (b'Content-Type', b'application/json'), (b'Transfer-Encoding', b'chunked'), (b'Connection', b'keep-alive'), (b'openai-organization', b'falkordb'), (b'openai-processing-ms', b'1306'), (b'openai-version', b'2020-10-01'), (b'strict-transport-security', b'max-age=31536000; includeSubDomains'), (b'x-ratelimit-limit-requests', b'10000'), (b'x-ratelimit-limit-tokens', b'22000000'), (b'x-ratelimit-remaining-requests', b'9999'), (b'x-ratelimit-remaining-tokens', b'21998437'), (b'x-ratelimit-reset-requests', b'6ms'), (b'x-ratelimit-reset-tokens', b'4ms'), (b'x-request-id', b'req_77f894d89250d841a3fc4e44775b743f'), (b'CF-Cache-Status', b'DYNAMIC'), (b'Set-Cookie', b'__cf_bm=UMkejvTrtfPEUfGmZSW3uE2J3VbAqKiNl_tphl3WVWk-1720685450-1.0.1.1-k7kTQ9izUYqcX1APTrVVkWv6crQjqFbuh3pmwHvxMOigisPBpNAXGwI2COBWA_y1Py8SjYYM9MwdzUAMnzThVw; path=/; expires=Thu, 11-Jul-24 08:40:50 GMT; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), (b'Set-Cookie', b'_cfuvid=qXOOGxBNOeQxRcvbs1w_mJLswzhkFGgIyutzj9KHz0k-1720685450630-0.0.1.1-604800000; path=/; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), (b'Server', b'cloudflare'), (b'CF-RAY', b'8a1751b8ad295258-MXP'), (b'Content-Encoding', b'gzip'), (b'alt-svc', b'h3=\":443\"; ma=86400')])\n",
      "2024-07-24 11:10:50 HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "2024-07-24 11:10:50 receive_response_body.started request=<Request [b'POST']>\n",
      "2024-07-24 11:10:50 receive_response_body.complete\n",
      "2024-07-24 11:10:50 response_closed.started\n",
      "2024-07-24 11:10:50 response_closed.complete\n",
      "2024-07-24 11:10:50 HTTP Response: POST https://api.openai.com/v1/chat/completions \"200 OK\" Headers([('date', 'Thu, 11 Jul 2024 08:10:50 GMT'), ('content-type', 'application/json'), ('transfer-encoding', 'chunked'), ('connection', 'keep-alive'), ('openai-organization', 'falkordb'), ('openai-processing-ms', '1306'), ('openai-version', '2020-10-01'), ('strict-transport-security', 'max-age=31536000; includeSubDomains'), ('x-ratelimit-limit-requests', '10000'), ('x-ratelimit-limit-tokens', '22000000'), ('x-ratelimit-remaining-requests', '9999'), ('x-ratelimit-remaining-tokens', '21998437'), ('x-ratelimit-reset-requests', '6ms'), ('x-ratelimit-reset-tokens', '4ms'), ('x-request-id', 'req_77f894d89250d841a3fc4e44775b743f'), ('cf-cache-status', 'DYNAMIC'), ('set-cookie', '__cf_bm=UMkejvTrtfPEUfGmZSW3uE2J3VbAqKiNl_tphl3WVWk-1720685450-1.0.1.1-k7kTQ9izUYqcX1APTrVVkWv6crQjqFbuh3pmwHvxMOigisPBpNAXGwI2COBWA_y1Py8SjYYM9MwdzUAMnzThVw; path=/; expires=Thu, 11-Jul-24 08:40:50 GMT; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), ('set-cookie', '_cfuvid=qXOOGxBNOeQxRcvbs1w_mJLswzhkFGgIyutzj9KHz0k-1720685450630-0.0.1.1-604800000; path=/; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), ('server', 'cloudflare'), ('cf-ray', '8a1751b8ad295258-MXP'), ('content-encoding', 'gzip'), ('alt-svc', 'h3=\":443\"; ma=86400')])\n",
      "2024-07-24 11:10:50 request_id: req_77f894d89250d841a3fc4e44775b743f\n",
      "2024-07-24 11:10:50 Cypher Statement Response: GenerationResponse(text=```\n",
      "MATCH (al:Airline)-[:ACCEPTS]->(p:Pet {type: 'dog'})\n",
      "RETURN al, p\n",
      "```, finish_reason=STOP)\n",
      "2024-07-24 11:10:50 Cypher: \n",
      "MATCH (al:Airline)-[:ACCEPTS]->(p:Pet {type: 'dog'})\n",
      "RETURN al, p\n",
      "\n",
      "2024-07-24 11:10:50 Context: []\n",
      "2024-07-24 11:10:50 Context size: 0\n",
      "2024-07-24 11:10:50 Context characters: 2\n",
      "2024-07-24 11:10:50 load_ssl_context verify=True cert=None trust_env=True http2=False\n",
      "2024-07-24 11:10:50 load_verify_locations cafile='/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/certifi/cacert.pem'\n",
      "2024-07-24 11:10:50 Request options: {'method': 'post', 'url': '/chat/completions', 'files': None, 'json_data': {'messages': [{'role': 'system', 'content': \"\\nYou are an assistant that helps to form nice and human understandable answers.\\nThe information part contains the provided information that you must use to construct an answer.\\nThe provided information is authoritative, you must never doubt it or try to use your internal knowledge to correct it.\\nMake the answer sound as a response to the question. Do not mention that you based the result on the given information.\\nDo not answer more than the question asks for.\\nHere is an example:\\n\\nQuestion: Which managers own Neo4j stocks?\\nContext:[manager:CTL LLC, manager:JANE STREET GROUP LLC]\\nHelpful Answer: CTL LLC, JANE STREET GROUP LLC owns Neo4j stocks.\\n\\nIf the provided information is empty, say that you don't know the answer.\\n\"}, {'role': 'user', 'content': \"\\nUse the following knowledge to answer the question at the end. \\n\\nCypher: \\nMATCH (al:Airline)-[:ACCEPTS]->(p:Pet {type: 'dog'})\\nRETURN al, p\\n\\n\\nContext: []\\n\\nQuestion: Can I take my dog with me on board?\\n\\nHelpful Answer:\"}], 'model': 'gpt-4o', 'max_tokens': None, 'stop': None, 'temperature': None, 'top_p': None}}\n",
      "2024-07-24 11:10:50 Sending HTTP Request: POST https://api.openai.com/v1/chat/completions\n",
      "2024-07-24 11:10:50 connect_tcp.started host='api.openai.com' port=443 local_address=None timeout=5.0 socket_options=None\n",
      "2024-07-24 11:10:50 connect_tcp.complete return_value=<httpcore._backends.sync.SyncStream object at 0x11fd01710>\n",
      "2024-07-24 11:10:50 start_tls.started ssl_context=<ssl.SSLContext object at 0x11fb25910> server_hostname='api.openai.com' timeout=5.0\n",
      "2024-07-24 11:10:50 start_tls.complete return_value=<httpcore._backends.sync.SyncStream object at 0x11fd81a50>\n",
      "2024-07-24 11:10:50 send_request_headers.started request=<Request [b'POST']>\n",
      "2024-07-24 11:10:50 send_request_headers.complete\n",
      "2024-07-24 11:10:50 send_request_body.started request=<Request [b'POST']>\n",
      "2024-07-24 11:10:50 send_request_body.complete\n",
      "2024-07-24 11:10:50 receive_response_headers.started request=<Request [b'POST']>\n",
      "2024-07-24 11:10:51 receive_response_headers.complete return_value=(b'HTTP/1.1', 200, b'OK', [(b'Date', b'Thu, 11 Jul 2024 08:10:51 GMT'), (b'Content-Type', b'application/json'), (b'Transfer-Encoding', b'chunked'), (b'Connection', b'keep-alive'), (b'openai-organization', b'falkordb'), (b'openai-processing-ms', b'275'), (b'openai-version', b'2020-10-01'), (b'strict-transport-security', b'max-age=31536000; includeSubDomains'), (b'x-ratelimit-limit-requests', b'10000'), (b'x-ratelimit-limit-tokens', b'22000000'), (b'x-ratelimit-remaining-requests', b'9999'), (b'x-ratelimit-remaining-tokens', b'21999746'), (b'x-ratelimit-reset-requests', b'6ms'), (b'x-ratelimit-reset-tokens', b'0s'), (b'x-request-id', b'req_2c694256178cf4e3f26d4cc6bdf1a881'), (b'CF-Cache-Status', b'DYNAMIC'), (b'Set-Cookie', b'__cf_bm=EBAn4dlcffRTKA0wRvewwhqluxBMFi07qepr5QI66T0-1720685451-1.0.1.1-C_3NmaxzGM_SGX0gGte0F3slfjiZcYjGBekNAsn0PEwJ.SLfQ3czEH.ual2hJiOUhaM.MdNA_eMY4v9ssu6.AA; path=/; expires=Thu, 11-Jul-24 08:40:51 GMT; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), (b'Set-Cookie', b'_cfuvid=NlrTsrRfhxh19PuN8RKCLSkU9wg8_rcwsxBP70mOMG0-1720685451532-0.0.1.1-604800000; path=/; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), (b'Server', b'cloudflare'), (b'CF-RAY', b'8a1751c44b9f0d5f-MXP'), (b'Content-Encoding', b'gzip'), (b'alt-svc', b'h3=\":443\"; ma=86400')])\n",
      "2024-07-24 11:10:51 HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "2024-07-24 11:10:51 receive_response_body.started request=<Request [b'POST']>\n",
      "2024-07-24 11:10:51 receive_response_body.complete\n",
      "2024-07-24 11:10:51 response_closed.started\n",
      "2024-07-24 11:10:51 response_closed.complete\n",
      "2024-07-24 11:10:51 HTTP Response: POST https://api.openai.com/v1/chat/completions \"200 OK\" Headers([('date', 'Thu, 11 Jul 2024 08:10:51 GMT'), ('content-type', 'application/json'), ('transfer-encoding', 'chunked'), ('connection', 'keep-alive'), ('openai-organization', 'falkordb'), ('openai-processing-ms', '275'), ('openai-version', '2020-10-01'), ('strict-transport-security', 'max-age=31536000; includeSubDomains'), ('x-ratelimit-limit-requests', '10000'), ('x-ratelimit-limit-tokens', '22000000'), ('x-ratelimit-remaining-requests', '9999'), ('x-ratelimit-remaining-tokens', '21999746'), ('x-ratelimit-reset-requests', '6ms'), ('x-ratelimit-reset-tokens', '0s'), ('x-request-id', 'req_2c694256178cf4e3f26d4cc6bdf1a881'), ('cf-cache-status', 'DYNAMIC'), ('set-cookie', '__cf_bm=EBAn4dlcffRTKA0wRvewwhqluxBMFi07qepr5QI66T0-1720685451-1.0.1.1-C_3NmaxzGM_SGX0gGte0F3slfjiZcYjGBekNAsn0PEwJ.SLfQ3czEH.ual2hJiOUhaM.MdNA_eMY4v9ssu6.AA; path=/; expires=Thu, 11-Jul-24 08:40:51 GMT; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), ('set-cookie', '_cfuvid=NlrTsrRfhxh19PuN8RKCLSkU9wg8_rcwsxBP70mOMG0-1720685451532-0.0.1.1-604800000; path=/; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), ('server', 'cloudflare'), ('cf-ray', '8a1751c44b9f0d5f-MXP'), ('content-encoding', 'gzip'), ('alt-svc', 'h3=\":443\"; ma=86400')])\n",
      "2024-07-24 11:10:51 request_id: req_2c694256178cf4e3f26d4cc6bdf1a881\n",
      "2024-07-24 11:10:51 load_ssl_context verify=True cert=None trust_env=True http2=False\n",
      "2024-07-24 11:10:51 load_verify_locations cafile='/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/certifi/cacert.pem'\n",
      "2024-07-24 11:10:51 close.started\n",
      "2024-07-24 11:10:51 close.complete\n",
      "2024-07-24 11:10:51 Cypher Prompt: \n",
      "Using the ontology provided, generate an OpenCypher statement to query the graph database returning all relevant entities, relationships, and attributes to answer the question below:\n",
      "If you cannot generate a OpenCypher statement for any reason, return an empty string.\n",
      "Respect the order of the relationships, the arrows should always point from the \"source\" to the \"target\".\n",
      "\n",
      "Question: How many falcons can I take with me on board?\n",
      "\n",
      "2024-07-24 11:10:51 Request options: {'method': 'post', 'url': '/chat/completions', 'files': None, 'json_data': {'messages': [{'role': 'system', 'content': '\\nTask: Generate OpenCypher statement to query a graph database.\\n\\nInstructions:\\nUse only the provided entities, relationships types and properties in the ontology.\\nThe output must be only a valid OpenCypher statement.\\nRespect the order of the relationships, the arrows should always point from the \"start\" to the \"end\".\\nRespect the types of entities of every relationship, according to the ontology.\\nThe OpenCypher statement must return all the relevant entities, not just the attributes requested.\\nThe output of the OpenCypher statement will be passed to another model to answer the question, hence, make sure the OpenCypher statement returns all relevant entities, relationships, and attributes.\\nIf the answer required multiple entities, return all the entities, relations, relationships, and their attributes.\\nIf you cannot generate a OpenCypher statement based on the provided ontology, explain the reason to the user.\\nFor String comparison, use the `CONTAINS` operator.\\nDo not use any other relationship types or properties that are not provided.\\nDo not respond to any questions that might ask anything else than for you to construct a OpenCypher statement.\\nDo not include any text except the generated OpenCypher statement, enclosed in triple backticks.\\nDo not include any explanations or apologies in your responses.\\nDo not return just the attributes requested in the question, but all related entities, relations, relationships, and attributes.\\nDo not change the order of the relationships, the arrows should always point from the \"start\" to the \"end\".\\n\\nThe following instructions describe extra functions that can be used in the OpenCypher statement:\\n\\nMatch: Describes relationships between entities using ASCII art patterns. Entities are represented by parentheses and relationships by brackets. Both can have aliases and labels.\\nVariable length relationships: Find entities a variable number of hops away using -[:TYPE*minHops..maxHops]->.\\nBidirectional path traversal: Specify relationship direction or omit it for either direction.\\nNamed paths: Assign a path in a MATCH clause to a single alias for future use.\\nShortest paths: Find all shortest paths between two entities using allShortestPaths().\\nSingle-Pair minimal-weight paths: Find minimal-weight paths between a pair of entities using algo.SPpaths().\\nSingle-Source minimal-weight paths: Find minimal-weight paths from a given source entity using algo.SSpaths().\\n\\nOntology:\\n{\\'entities\\': [{\\'label\\': \\'Airline\\', \\'attributes\\': [{\\'name\\': \\'name\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}], \\'description\\': \\'\\'}, {\\'label\\': \\'Pet\\', \\'attributes\\': [{\\'name\\': \\'type\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'travel_method\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'health_status\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'route\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'max_per_cabin\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'max_per_passenger\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}], \\'description\\': \\'\\'}, {\\'label\\': \\'HealthCertificate\\', \\'attributes\\': [{\\'name\\': \\'type\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'signed_by\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': True}, {\\'name\\': \\'fit_to_fly\\', \\'type\\': \\'boolean\\', \\'unique\\': False, \\'required\\': True}], \\'description\\': \\'\\'}, {\\'label\\': \\'PetContainer\\', \\'attributes\\': [{\\'name\\': \\'type\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'size\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'ventilation\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'design\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'strength\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}], \\'description\\': \\'\\'}, {\\'label\\': \\'Nationality\\', \\'attributes\\': [{\\'name\\': \\'country\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}], \\'description\\': \\'\\'}, {\\'label\\': \\'Document\\', \\'attributes\\': [{\\'name\\': \\'type\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'source\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'required\\', \\'type\\': \\'boolean\\', \\'unique\\': False, \\'required\\': False}], \\'description\\': \\'\\'}, {\\'label\\': \\'ServiceDog\\', \\'attributes\\': [{\\'name\\': \\'name\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'route\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'cabin_free_of_charge\\', \\'type\\': \\'boolean\\', \\'unique\\': False, \\'required\\': False}], \\'description\\': \\'\\'}, {\\'label\\': \\'Country\\', \\'attributes\\': [{\\'name\\': \\'name\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}], \\'description\\': \\'\\'}, {\\'label\\': \\'TransferCare\\', \\'attributes\\': [{\\'name\\': \\'details\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}], \\'description\\': \\'\\'}], \\'relations\\': [{\\'label\\': \\'ACCEPTS\\', \\'source\\': {\\'label\\': \\'Airline\\'}, \\'target\\': {\\'label\\': \\'Pet\\'}, \\'attributes\\': []}, {\\'label\\': \\'HAS\\', \\'source\\': {\\'label\\': \\'Pet\\'}, \\'target\\': {\\'label\\': \\'HealthCertificate\\'}, \\'attributes\\': []}, {\\'label\\': \\'REQUIRES\\', \\'source\\': {\\'label\\': \\'Airline\\'}, \\'target\\': {\\'label\\': \\'Document\\'}, \\'attributes\\': []}, {\\'label\\': \\'USES\\', \\'source\\': {\\'label\\': \\'Pet\\'}, \\'target\\': {\\'label\\': \\'PetContainer\\'}, \\'attributes\\': []}, {\\'label\\': \\'ALLOWS\\', \\'source\\': {\\'label\\': \\'Airline\\'}, \\'target\\': {\\'label\\': \\'ServiceDog\\'}, \\'attributes\\': []}, {\\'label\\': \\'HAS_RESTRICTIONS\\', \\'source\\': {\\'label\\': \\'Airline\\'}, \\'target\\': {\\'label\\': \\'Country\\'}, \\'attributes\\': []}, {\\'label\\': \\'RECEIVES\\', \\'source\\': {\\'label\\': \\'Pet\\'}, \\'target\\': {\\'label\\': \\'TransferCare\\'}, \\'attributes\\': []}]}\\n\\n\\nFor example, given the question \"Which managers own Neo4j stocks?\", the OpenCypher statement should look like this:\\n```\\nMATCH (m:Manager)-[:OWNS]->(s:Stock)\\nWHERE s.name CONTAINS \\'Neo4j\\'\\nRETURN m, s\\n```\\n'}, {'role': 'user', 'content': '\\nUsing the ontology provided, generate an OpenCypher statement to query the graph database returning all relevant entities, relationships, and attributes to answer the question below:\\nIf you cannot generate a OpenCypher statement for any reason, return an empty string.\\nRespect the order of the relationships, the arrows should always point from the \"source\" to the \"target\".\\n\\nQuestion: How many falcons can I take with me on board?\\n'}], 'model': 'gpt-4o', 'max_tokens': None, 'stop': None, 'temperature': None, 'top_p': None}}\n",
      "2024-07-24 11:10:51 Sending HTTP Request: POST https://api.openai.com/v1/chat/completions\n",
      "2024-07-24 11:10:51 connect_tcp.started host='api.openai.com' port=443 local_address=None timeout=5.0 socket_options=None\n",
      "2024-07-24 11:10:51 connect_tcp.complete return_value=<httpcore._backends.sync.SyncStream object at 0x11fd61a50>\n",
      "2024-07-24 11:10:51 start_tls.started ssl_context=<ssl.SSLContext object at 0x11fb25a30> server_hostname='api.openai.com' timeout=5.0\n",
      "2024-07-24 11:10:51 start_tls.complete return_value=<httpcore._backends.sync.SyncStream object at 0x11fd61e90>\n",
      "2024-07-24 11:10:51 send_request_headers.started request=<Request [b'POST']>\n",
      "2024-07-24 11:10:51 send_request_headers.complete\n",
      "2024-07-24 11:10:51 send_request_body.started request=<Request [b'POST']>\n",
      "2024-07-24 11:10:51 send_request_body.complete\n",
      "2024-07-24 11:10:51 receive_response_headers.started request=<Request [b'POST']>\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "I don't have the specific information about whether you can take your dog on board.\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "2024-07-24 11:10:53 receive_response_headers.complete return_value=(b'HTTP/1.1', 200, b'OK', [(b'Date', b'Thu, 11 Jul 2024 08:10:53 GMT'), (b'Content-Type', b'application/json'), (b'Transfer-Encoding', b'chunked'), (b'Connection', b'keep-alive'), (b'openai-organization', b'falkordb'), (b'openai-processing-ms', b'1067'), (b'openai-version', b'2020-10-01'), (b'strict-transport-security', b'max-age=31536000; includeSubDomains'), (b'x-ratelimit-limit-requests', b'10000'), (b'x-ratelimit-limit-tokens', b'22000000'), (b'x-ratelimit-remaining-requests', b'9999'), (b'x-ratelimit-remaining-tokens', b'21998433'), (b'x-ratelimit-reset-requests', b'6ms'), (b'x-ratelimit-reset-tokens', b'4ms'), (b'x-request-id', b'req_85670c0d9aab18c4a97a031a7d573ce7'), (b'CF-Cache-Status', b'DYNAMIC'), (b'Set-Cookie', b'__cf_bm=M56LAZmvuZJeKYxZCVDn9G70GD1OyEO5449bdRCqWGI-1720685453-1.0.1.1-nA3rkDa2WFT9sOFRiQVMcYW6NweVQPxYc_MPnhVa0zCoizvhxAJZNElYxX.gTLoFgHKMEgeKUmsx5UkjC6WfTA; path=/; expires=Thu, 11-Jul-24 08:40:53 GMT; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), (b'Set-Cookie', b'_cfuvid=qEuDK1utvI3dYYO5loHLasjvWOhqolh_TgIJ_BW99GM-1720685453132-0.0.1.1-604800000; path=/; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), (b'Server', b'cloudflare'), (b'CF-RAY', b'8a1751c97df63755-MXP'), (b'Content-Encoding', b'gzip'), (b'alt-svc', b'h3=\":443\"; ma=86400')])\n",
      "2024-07-24 11:10:53 HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "2024-07-24 11:10:53 receive_response_body.started request=<Request [b'POST']>\n",
      "2024-07-24 11:10:53 receive_response_body.complete\n",
      "2024-07-24 11:10:53 response_closed.started\n",
      "2024-07-24 11:10:53 response_closed.complete\n",
      "2024-07-24 11:10:53 HTTP Response: POST https://api.openai.com/v1/chat/completions \"200 OK\" Headers([('date', 'Thu, 11 Jul 2024 08:10:53 GMT'), ('content-type', 'application/json'), ('transfer-encoding', 'chunked'), ('connection', 'keep-alive'), ('openai-organization', 'falkordb'), ('openai-processing-ms', '1067'), ('openai-version', '2020-10-01'), ('strict-transport-security', 'max-age=31536000; includeSubDomains'), ('x-ratelimit-limit-requests', '10000'), ('x-ratelimit-limit-tokens', '22000000'), ('x-ratelimit-remaining-requests', '9999'), ('x-ratelimit-remaining-tokens', '21998433'), ('x-ratelimit-reset-requests', '6ms'), ('x-ratelimit-reset-tokens', '4ms'), ('x-request-id', 'req_85670c0d9aab18c4a97a031a7d573ce7'), ('cf-cache-status', 'DYNAMIC'), ('set-cookie', '__cf_bm=M56LAZmvuZJeKYxZCVDn9G70GD1OyEO5449bdRCqWGI-1720685453-1.0.1.1-nA3rkDa2WFT9sOFRiQVMcYW6NweVQPxYc_MPnhVa0zCoizvhxAJZNElYxX.gTLoFgHKMEgeKUmsx5UkjC6WfTA; path=/; expires=Thu, 11-Jul-24 08:40:53 GMT; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), ('set-cookie', '_cfuvid=qEuDK1utvI3dYYO5loHLasjvWOhqolh_TgIJ_BW99GM-1720685453132-0.0.1.1-604800000; path=/; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), ('server', 'cloudflare'), ('cf-ray', '8a1751c97df63755-MXP'), ('content-encoding', 'gzip'), ('alt-svc', 'h3=\":443\"; ma=86400')])\n",
      "2024-07-24 11:10:53 request_id: req_85670c0d9aab18c4a97a031a7d573ce7\n",
      "2024-07-24 11:10:53 Cypher Statement Response: GenerationResponse(text=```\n",
      "MATCH (a:Airline)-[:ACCEPTS]->(p:Pet)\n",
      "WHERE p.type CONTAINS 'falcon'\n",
      "RETURN a, p\n",
      "```, finish_reason=STOP)\n",
      "2024-07-24 11:10:53 Cypher: \n",
      "MATCH (a:Airline)-[:ACCEPTS]->(p:Pet)\n",
      "WHERE p.type CONTAINS 'falcon'\n",
      "RETURN a, p\n",
      "\n",
      "2024-07-24 11:10:53 Context: []\n",
      "2024-07-24 11:10:53 Context size: 0\n",
      "2024-07-24 11:10:53 Context characters: 2\n",
      "2024-07-24 11:10:53 load_ssl_context verify=True cert=None trust_env=True http2=False\n",
      "2024-07-24 11:10:53 load_verify_locations cafile='/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/certifi/cacert.pem'\n",
      "2024-07-24 11:10:53 Request options: {'method': 'post', 'url': '/chat/completions', 'files': None, 'json_data': {'messages': [{'role': 'system', 'content': \"\\nYou are an assistant that helps to form nice and human understandable answers.\\nThe information part contains the provided information that you must use to construct an answer.\\nThe provided information is authoritative, you must never doubt it or try to use your internal knowledge to correct it.\\nMake the answer sound as a response to the question. Do not mention that you based the result on the given information.\\nDo not answer more than the question asks for.\\nHere is an example:\\n\\nQuestion: Which managers own Neo4j stocks?\\nContext:[manager:CTL LLC, manager:JANE STREET GROUP LLC]\\nHelpful Answer: CTL LLC, JANE STREET GROUP LLC owns Neo4j stocks.\\n\\nIf the provided information is empty, say that you don't know the answer.\\n\"}, {'role': 'user', 'content': \"\\nUse the following knowledge to answer the question at the end. \\n\\nCypher: \\nMATCH (a:Airline)-[:ACCEPTS]->(p:Pet)\\nWHERE p.type CONTAINS 'falcon'\\nRETURN a, p\\n\\n\\nContext: []\\n\\nQuestion: How many falcons can I take with me on board?\\n\\nHelpful Answer:\"}], 'model': 'gpt-4o', 'max_tokens': None, 'stop': None, 'temperature': None, 'top_p': None}}\n",
      "2024-07-24 11:10:53 Sending HTTP Request: POST https://api.openai.com/v1/chat/completions\n",
      "2024-07-24 11:10:53 connect_tcp.started host='api.openai.com' port=443 local_address=None timeout=5.0 socket_options=None\n",
      "2024-07-24 11:10:53 connect_tcp.complete return_value=<httpcore._backends.sync.SyncStream object at 0x11fb9b4d0>\n",
      "2024-07-24 11:10:53 start_tls.started ssl_context=<ssl.SSLContext object at 0x11fb25910> server_hostname='api.openai.com' timeout=5.0\n",
      "2024-07-24 11:10:53 start_tls.complete return_value=<httpcore._backends.sync.SyncStream object at 0x11fd30490>\n",
      "2024-07-24 11:10:53 send_request_headers.started request=<Request [b'POST']>\n",
      "2024-07-24 11:10:53 send_request_headers.complete\n",
      "2024-07-24 11:10:53 send_request_body.started request=<Request [b'POST']>\n",
      "2024-07-24 11:10:53 send_request_body.complete\n",
      "2024-07-24 11:10:53 receive_response_headers.started request=<Request [b'POST']>\n",
      "2024-07-24 11:10:54 receive_response_headers.complete return_value=(b'HTTP/1.1', 200, b'OK', [(b'Date', b'Thu, 11 Jul 2024 08:10:54 GMT'), (b'Content-Type', b'application/json'), (b'Transfer-Encoding', b'chunked'), (b'Connection', b'keep-alive'), (b'openai-organization', b'falkordb'), (b'openai-processing-ms', b'498'), (b'openai-version', b'2020-10-01'), (b'strict-transport-security', b'max-age=31536000; includeSubDomains'), (b'x-ratelimit-limit-requests', b'10000'), (b'x-ratelimit-limit-tokens', b'22000000'), (b'x-ratelimit-remaining-requests', b'9999'), (b'x-ratelimit-remaining-tokens', b'21999739'), (b'x-ratelimit-reset-requests', b'6ms'), (b'x-ratelimit-reset-tokens', b'0s'), (b'x-request-id', b'req_c11ae2102e8d9f2039a2c945919068f9'), (b'CF-Cache-Status', b'DYNAMIC'), (b'Set-Cookie', b'__cf_bm=7pwG25PE.BnOLHczVv1BRqxB9G7xR4L3wyZj0AOon4g-1720685454-1.0.1.1-nj9DwZjl42Zbz8.FtMDq4HqwDK3a7GeHEYT1X806cxDVIoDuc1JWODn8uJbMK7QJ5dKds_a3QAk7MS9M_XLKMg; path=/; expires=Thu, 11-Jul-24 08:40:54 GMT; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), (b'Set-Cookie', b'_cfuvid=202w6WVlNwmiiWBnyOBG4UXpJjMdAZxYgXB1W_MVMaE-1720685454147-0.0.1.1-604800000; path=/; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), (b'Server', b'cloudflare'), (b'CF-RAY', b'8a1751d3e86e4bf4-MXP'), (b'Content-Encoding', b'gzip'), (b'alt-svc', b'h3=\":443\"; ma=86400')])\n",
      "2024-07-24 11:10:54 HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "2024-07-24 11:10:54 receive_response_body.started request=<Request [b'POST']>\n",
      "2024-07-24 11:10:54 receive_response_body.complete\n",
      "2024-07-24 11:10:54 response_closed.started\n",
      "2024-07-24 11:10:54 response_closed.complete\n",
      "2024-07-24 11:10:54 HTTP Response: POST https://api.openai.com/v1/chat/completions \"200 OK\" Headers([('date', 'Thu, 11 Jul 2024 08:10:54 GMT'), ('content-type', 'application/json'), ('transfer-encoding', 'chunked'), ('connection', 'keep-alive'), ('openai-organization', 'falkordb'), ('openai-processing-ms', '498'), ('openai-version', '2020-10-01'), ('strict-transport-security', 'max-age=31536000; includeSubDomains'), ('x-ratelimit-limit-requests', '10000'), ('x-ratelimit-limit-tokens', '22000000'), ('x-ratelimit-remaining-requests', '9999'), ('x-ratelimit-remaining-tokens', '21999739'), ('x-ratelimit-reset-requests', '6ms'), ('x-ratelimit-reset-tokens', '0s'), ('x-request-id', 'req_c11ae2102e8d9f2039a2c945919068f9'), ('cf-cache-status', 'DYNAMIC'), ('set-cookie', '__cf_bm=7pwG25PE.BnOLHczVv1BRqxB9G7xR4L3wyZj0AOon4g-1720685454-1.0.1.1-nj9DwZjl42Zbz8.FtMDq4HqwDK3a7GeHEYT1X806cxDVIoDuc1JWODn8uJbMK7QJ5dKds_a3QAk7MS9M_XLKMg; path=/; expires=Thu, 11-Jul-24 08:40:54 GMT; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), ('set-cookie', '_cfuvid=202w6WVlNwmiiWBnyOBG4UXpJjMdAZxYgXB1W_MVMaE-1720685454147-0.0.1.1-604800000; path=/; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), ('server', 'cloudflare'), ('cf-ray', '8a1751d3e86e4bf4-MXP'), ('content-encoding', 'gzip'), ('alt-svc', 'h3=\":443\"; ma=86400')])\n",
      "2024-07-24 11:10:54 request_id: req_c11ae2102e8d9f2039a2c945919068f9\n",
      "2024-07-24 11:10:54 load_ssl_context verify=True cert=None trust_env=True http2=False\n",
      "2024-07-24 11:10:54 load_verify_locations cafile='/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/certifi/cacert.pem'\n",
      "2024-07-24 11:10:54 Cypher Prompt: \n",
      "Using the ontology provided, generate an OpenCypher statement to query the graph database returning all relevant entities, relationships, and attributes to answer the question below:\n",
      "If you cannot generate a OpenCypher statement for any reason, return an empty string.\n",
      "Respect the order of the relationships, the arrows should always point from the \"source\" to the \"target\".\n",
      "\n",
      "Question: How does pet care work during transfer?\n",
      "\n",
      "2024-07-24 11:10:54 Request options: {'method': 'post', 'url': '/chat/completions', 'files': None, 'json_data': {'messages': [{'role': 'system', 'content': '\\nTask: Generate OpenCypher statement to query a graph database.\\n\\nInstructions:\\nUse only the provided entities, relationships types and properties in the ontology.\\nThe output must be only a valid OpenCypher statement.\\nRespect the order of the relationships, the arrows should always point from the \"start\" to the \"end\".\\nRespect the types of entities of every relationship, according to the ontology.\\nThe OpenCypher statement must return all the relevant entities, not just the attributes requested.\\nThe output of the OpenCypher statement will be passed to another model to answer the question, hence, make sure the OpenCypher statement returns all relevant entities, relationships, and attributes.\\nIf the answer required multiple entities, return all the entities, relations, relationships, and their attributes.\\nIf you cannot generate a OpenCypher statement based on the provided ontology, explain the reason to the user.\\nFor String comparison, use the `CONTAINS` operator.\\nDo not use any other relationship types or properties that are not provided.\\nDo not respond to any questions that might ask anything else than for you to construct a OpenCypher statement.\\nDo not include any text except the generated OpenCypher statement, enclosed in triple backticks.\\nDo not include any explanations or apologies in your responses.\\nDo not return just the attributes requested in the question, but all related entities, relations, relationships, and attributes.\\nDo not change the order of the relationships, the arrows should always point from the \"start\" to the \"end\".\\n\\nThe following instructions describe extra functions that can be used in the OpenCypher statement:\\n\\nMatch: Describes relationships between entities using ASCII art patterns. Entities are represented by parentheses and relationships by brackets. Both can have aliases and labels.\\nVariable length relationships: Find entities a variable number of hops away using -[:TYPE*minHops..maxHops]->.\\nBidirectional path traversal: Specify relationship direction or omit it for either direction.\\nNamed paths: Assign a path in a MATCH clause to a single alias for future use.\\nShortest paths: Find all shortest paths between two entities using allShortestPaths().\\nSingle-Pair minimal-weight paths: Find minimal-weight paths between a pair of entities using algo.SPpaths().\\nSingle-Source minimal-weight paths: Find minimal-weight paths from a given source entity using algo.SSpaths().\\n\\nOntology:\\n{\\'entities\\': [{\\'label\\': \\'Airline\\', \\'attributes\\': [{\\'name\\': \\'name\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}], \\'description\\': \\'\\'}, {\\'label\\': \\'Pet\\', \\'attributes\\': [{\\'name\\': \\'type\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'travel_method\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'health_status\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'route\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'max_per_cabin\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'max_per_passenger\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}], \\'description\\': \\'\\'}, {\\'label\\': \\'HealthCertificate\\', \\'attributes\\': [{\\'name\\': \\'type\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'signed_by\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': True}, {\\'name\\': \\'fit_to_fly\\', \\'type\\': \\'boolean\\', \\'unique\\': False, \\'required\\': True}], \\'description\\': \\'\\'}, {\\'label\\': \\'PetContainer\\', \\'attributes\\': [{\\'name\\': \\'type\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'size\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'ventilation\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'design\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'strength\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}], \\'description\\': \\'\\'}, {\\'label\\': \\'Nationality\\', \\'attributes\\': [{\\'name\\': \\'country\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}], \\'description\\': \\'\\'}, {\\'label\\': \\'Document\\', \\'attributes\\': [{\\'name\\': \\'type\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'source\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'required\\', \\'type\\': \\'boolean\\', \\'unique\\': False, \\'required\\': False}], \\'description\\': \\'\\'}, {\\'label\\': \\'ServiceDog\\', \\'attributes\\': [{\\'name\\': \\'name\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'route\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'cabin_free_of_charge\\', \\'type\\': \\'boolean\\', \\'unique\\': False, \\'required\\': False}], \\'description\\': \\'\\'}, {\\'label\\': \\'Country\\', \\'attributes\\': [{\\'name\\': \\'name\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}], \\'description\\': \\'\\'}, {\\'label\\': \\'TransferCare\\', \\'attributes\\': [{\\'name\\': \\'details\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}], \\'description\\': \\'\\'}], \\'relations\\': [{\\'label\\': \\'ACCEPTS\\', \\'source\\': {\\'label\\': \\'Airline\\'}, \\'target\\': {\\'label\\': \\'Pet\\'}, \\'attributes\\': []}, {\\'label\\': \\'HAS\\', \\'source\\': {\\'label\\': \\'Pet\\'}, \\'target\\': {\\'label\\': \\'HealthCertificate\\'}, \\'attributes\\': []}, {\\'label\\': \\'REQUIRES\\', \\'source\\': {\\'label\\': \\'Airline\\'}, \\'target\\': {\\'label\\': \\'Document\\'}, \\'attributes\\': []}, {\\'label\\': \\'USES\\', \\'source\\': {\\'label\\': \\'Pet\\'}, \\'target\\': {\\'label\\': \\'PetContainer\\'}, \\'attributes\\': []}, {\\'label\\': \\'ALLOWS\\', \\'source\\': {\\'label\\': \\'Airline\\'}, \\'target\\': {\\'label\\': \\'ServiceDog\\'}, \\'attributes\\': []}, {\\'label\\': \\'HAS_RESTRICTIONS\\', \\'source\\': {\\'label\\': \\'Airline\\'}, \\'target\\': {\\'label\\': \\'Country\\'}, \\'attributes\\': []}, {\\'label\\': \\'RECEIVES\\', \\'source\\': {\\'label\\': \\'Pet\\'}, \\'target\\': {\\'label\\': \\'TransferCare\\'}, \\'attributes\\': []}]}\\n\\n\\nFor example, given the question \"Which managers own Neo4j stocks?\", the OpenCypher statement should look like this:\\n```\\nMATCH (m:Manager)-[:OWNS]->(s:Stock)\\nWHERE s.name CONTAINS \\'Neo4j\\'\\nRETURN m, s\\n```\\n'}, {'role': 'user', 'content': '\\nUsing the ontology provided, generate an OpenCypher statement to query the graph database returning all relevant entities, relationships, and attributes to answer the question below:\\nIf you cannot generate a OpenCypher statement for any reason, return an empty string.\\nRespect the order of the relationships, the arrows should always point from the \"source\" to the \"target\".\\n\\nQuestion: How does pet care work during transfer?\\n'}], 'model': 'gpt-4o', 'max_tokens': None, 'stop': None, 'temperature': None, 'top_p': None}}\n",
      "2024-07-24 11:10:54 Sending HTTP Request: POST https://api.openai.com/v1/chat/completions\n",
      "2024-07-24 11:10:54 connect_tcp.started host='api.openai.com' port=443 local_address=None timeout=5.0 socket_options=None\n",
      "2024-07-24 11:10:54 connect_tcp.complete return_value=<httpcore._backends.sync.SyncStream object at 0x11fd41410>\n",
      "2024-07-24 11:10:54 start_tls.started ssl_context=<ssl.SSLContext object at 0x11fb26330> server_hostname='api.openai.com' timeout=5.0\n",
      "2024-07-24 11:10:54 start_tls.complete return_value=<httpcore._backends.sync.SyncStream object at 0x11fdb1450>\n",
      "2024-07-24 11:10:54 send_request_headers.started request=<Request [b'POST']>\n",
      "2024-07-24 11:10:54 send_request_headers.complete\n",
      "IOStream.flush timed out2024-07-24 11:10:54 close.started\n",
      "\n",
      "2024-07-24 11:11:04 send_request_body.started request=<Request [b'POST']>\n",
      "2024-07-24 11:11:04 close.complete\n",
      "IOStream.flush timed out\n",
      "2024-07-24 11:11:14 send_request_body.failed exception=WriteError(SSLEOFError(8, 'EOF occurred in violation of protocol (_ssl.c:2423)'))\n",
      "IOStream.flush timed out\n",
      "2024-07-24 11:11:14 close.started\n",
      "2024-07-24 11:11:24 receive_response_headers.started request=<Request [b'POST']>\n",
      "2024-07-24 11:11:24 close.complete\n",
      "IOStream.flush timed out\n",
      "2024-07-24 11:11:34 close.started\n",
      "2024-07-24 11:11:34 receive_response_headers.failed exception=RemoteProtocolError('Server disconnected without sending a response.')\n",
      "IOStream.flush timed out\n",
      "2024-07-24 11:11:34 close.complete\n",
      "2024-07-24 11:11:44 response_closed.started\n",
      "IOStream.flush timed out\n",
      "2024-07-24 11:11:44 close.started\n",
      "2024-07-24 11:11:54 response_closed.complete\n",
      "IOStream.flush timed out\n",
      "2024-07-24 11:11:54 close.complete\n",
      "2024-07-24 11:12:04 Encountered Exception\n",
      "Traceback (most recent call last):\n",
      "  File \"/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/httpx/_transports/default.py\", line 69, in map_httpcore_exceptions\n",
      "    yield\n",
      "  File \"/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/httpx/_transports/default.py\", line 233, in handle_request\n",
      "    resp = self._pool.handle_request(req)\n",
      "           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n",
      "  File \"/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/httpcore/_sync/connection_pool.py\", line 216, in handle_request\n",
      "    raise exc from None\n",
      "  File \"/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/httpcore/_sync/connection_pool.py\", line 196, in handle_request\n",
      "    response = connection.handle_request(\n",
      "               ^^^^^^^^^^^^^^^^^^^^^^^^^^\n",
      "  File \"/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/httpcore/_sync/connection.py\", line 101, in handle_request\n",
      "    return self._connection.handle_request(request)\n",
      "           ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n",
      "  File \"/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/httpcore/_sync/http11.py\", line 143, in handle_request\n",
      "    raise exc\n",
      "  File \"/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/httpcore/_sync/http11.py\", line 113, in handle_request\n",
      "    ) = self._receive_response_headers(**kwargs)\n",
      "        ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n",
      "  File \"/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/httpcore/_sync/http11.py\", line 186, in _receive_response_headers\n",
      "    event = self._receive_event(timeout=timeout)\n",
      "            ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n",
      "  File \"/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/httpcore/_sync/http11.py\", line 238, in _receive_event\n",
      "    raise RemoteProtocolError(msg)\n",
      "httpcore.RemoteProtocolError: Server disconnected without sending a response.\n",
      "\n",
      "The above exception was the direct cause of the following exception:\n",
      "\n",
      "Traceback (most recent call last):\n",
      "  File \"/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/openai/_base_client.py\", line 973, in _request\n",
      "    response = self._client.send(\n",
      "               ^^^^^^^^^^^^^^^^^^\n",
      "  File \"/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/httpx/_client.py\", line 914, in send\n",
      "    response = self._send_handling_auth(\n",
      "               ^^^^^^^^^^^^^^^^^^^^^^^^^\n",
      "  File \"/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/httpx/_client.py\", line 942, in _send_handling_auth\n",
      "    response = self._send_handling_redirects(\n",
      "               ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n",
      "  File \"/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/httpx/_client.py\", line 979, in _send_handling_redirects\n",
      "    response = self._send_single_request(request)\n",
      "               ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n",
      "  File \"/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/httpx/_client.py\", line 1015, in _send_single_request\n",
      "    response = transport.handle_request(request)\n",
      "               ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n",
      "  File \"/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/httpx/_transports/default.py\", line 232, in handle_request\n",
      "    with map_httpcore_exceptions():\n",
      "  File \"/Users/davidzimberknopf/.pyenv/versions/3.11.4/lib/python3.11/contextlib.py\", line 155, in __exit__\n",
      "    self.gen.throw(typ, value, traceback)\n",
      "  File \"/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/httpx/_transports/default.py\", line 86, in map_httpcore_exceptions\n",
      "    raise mapped_exc(message) from exc\n",
      "httpx.RemoteProtocolError: Server disconnected without sending a response.\n",
      "IOStream.flush timed out\n",
      "2024-07-24 11:12:04 close.started\n",
      "2024-07-24 11:12:14 1 retry left\n",
      "IOStream.flush timed out2024-07-24 11:12:14 close.complete\n",
      "\n",
      "2024-07-24 11:12:24 Retrying request to /chat/completions in 0.775082 seconds\n",
      "IOStream.flush timed out\n",
      "2024-07-24 11:12:24 close.started\n",
      "2024-07-24 11:12:34 close.complete\n",
      "2024-07-24 11:12:34 close.started\n",
      "2024-07-24 11:12:34 close.complete\n",
      "2024-07-24 11:12:34 close.started\n",
      "2024-07-24 11:12:34 close.complete\n",
      "2024-07-24 11:12:34 close.started\n",
      "2024-07-24 11:12:34 close.complete\n",
      "2024-07-24 11:12:34 close.started\n",
      "2024-07-24 11:12:34 close.complete\n",
      "2024-07-24 11:12:34 close.started\n",
      "2024-07-24 11:12:34 close.complete\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "I don't know the answer.\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "2024-07-24 11:12:35 Request options: {'method': 'post', 'url': '/chat/completions', 'files': None, 'json_data': {'messages': [{'role': 'system', 'content': '\\nTask: Generate OpenCypher statement to query a graph database.\\n\\nInstructions:\\nUse only the provided entities, relationships types and properties in the ontology.\\nThe output must be only a valid OpenCypher statement.\\nRespect the order of the relationships, the arrows should always point from the \"start\" to the \"end\".\\nRespect the types of entities of every relationship, according to the ontology.\\nThe OpenCypher statement must return all the relevant entities, not just the attributes requested.\\nThe output of the OpenCypher statement will be passed to another model to answer the question, hence, make sure the OpenCypher statement returns all relevant entities, relationships, and attributes.\\nIf the answer required multiple entities, return all the entities, relations, relationships, and their attributes.\\nIf you cannot generate a OpenCypher statement based on the provided ontology, explain the reason to the user.\\nFor String comparison, use the `CONTAINS` operator.\\nDo not use any other relationship types or properties that are not provided.\\nDo not respond to any questions that might ask anything else than for you to construct a OpenCypher statement.\\nDo not include any text except the generated OpenCypher statement, enclosed in triple backticks.\\nDo not include any explanations or apologies in your responses.\\nDo not return just the attributes requested in the question, but all related entities, relations, relationships, and attributes.\\nDo not change the order of the relationships, the arrows should always point from the \"start\" to the \"end\".\\n\\nThe following instructions describe extra functions that can be used in the OpenCypher statement:\\n\\nMatch: Describes relationships between entities using ASCII art patterns. Entities are represented by parentheses and relationships by brackets. Both can have aliases and labels.\\nVariable length relationships: Find entities a variable number of hops away using -[:TYPE*minHops..maxHops]->.\\nBidirectional path traversal: Specify relationship direction or omit it for either direction.\\nNamed paths: Assign a path in a MATCH clause to a single alias for future use.\\nShortest paths: Find all shortest paths between two entities using allShortestPaths().\\nSingle-Pair minimal-weight paths: Find minimal-weight paths between a pair of entities using algo.SPpaths().\\nSingle-Source minimal-weight paths: Find minimal-weight paths from a given source entity using algo.SSpaths().\\n\\nOntology:\\n{\\'entities\\': [{\\'label\\': \\'Airline\\', \\'attributes\\': [{\\'name\\': \\'name\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}], \\'description\\': \\'\\'}, {\\'label\\': \\'Pet\\', \\'attributes\\': [{\\'name\\': \\'type\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'travel_method\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'health_status\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'route\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'max_per_cabin\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'max_per_passenger\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}], \\'description\\': \\'\\'}, {\\'label\\': \\'HealthCertificate\\', \\'attributes\\': [{\\'name\\': \\'type\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'signed_by\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': True}, {\\'name\\': \\'fit_to_fly\\', \\'type\\': \\'boolean\\', \\'unique\\': False, \\'required\\': True}], \\'description\\': \\'\\'}, {\\'label\\': \\'PetContainer\\', \\'attributes\\': [{\\'name\\': \\'type\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'size\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'ventilation\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'design\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'strength\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}], \\'description\\': \\'\\'}, {\\'label\\': \\'Nationality\\', \\'attributes\\': [{\\'name\\': \\'country\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}], \\'description\\': \\'\\'}, {\\'label\\': \\'Document\\', \\'attributes\\': [{\\'name\\': \\'type\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'source\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'required\\', \\'type\\': \\'boolean\\', \\'unique\\': False, \\'required\\': False}], \\'description\\': \\'\\'}, {\\'label\\': \\'ServiceDog\\', \\'attributes\\': [{\\'name\\': \\'name\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}, {\\'name\\': \\'route\\', \\'type\\': \\'string\\', \\'unique\\': False, \\'required\\': False}, {\\'name\\': \\'cabin_free_of_charge\\', \\'type\\': \\'boolean\\', \\'unique\\': False, \\'required\\': False}], \\'description\\': \\'\\'}, {\\'label\\': \\'Country\\', \\'attributes\\': [{\\'name\\': \\'name\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}], \\'description\\': \\'\\'}, {\\'label\\': \\'TransferCare\\', \\'attributes\\': [{\\'name\\': \\'details\\', \\'type\\': \\'string\\', \\'unique\\': True, \\'required\\': True}], \\'description\\': \\'\\'}], \\'relations\\': [{\\'label\\': \\'ACCEPTS\\', \\'source\\': {\\'label\\': \\'Airline\\'}, \\'target\\': {\\'label\\': \\'Pet\\'}, \\'attributes\\': []}, {\\'label\\': \\'HAS\\', \\'source\\': {\\'label\\': \\'Pet\\'}, \\'target\\': {\\'label\\': \\'HealthCertificate\\'}, \\'attributes\\': []}, {\\'label\\': \\'REQUIRES\\', \\'source\\': {\\'label\\': \\'Airline\\'}, \\'target\\': {\\'label\\': \\'Document\\'}, \\'attributes\\': []}, {\\'label\\': \\'USES\\', \\'source\\': {\\'label\\': \\'Pet\\'}, \\'target\\': {\\'label\\': \\'PetContainer\\'}, \\'attributes\\': []}, {\\'label\\': \\'ALLOWS\\', \\'source\\': {\\'label\\': \\'Airline\\'}, \\'target\\': {\\'label\\': \\'ServiceDog\\'}, \\'attributes\\': []}, {\\'label\\': \\'HAS_RESTRICTIONS\\', \\'source\\': {\\'label\\': \\'Airline\\'}, \\'target\\': {\\'label\\': \\'Country\\'}, \\'attributes\\': []}, {\\'label\\': \\'RECEIVES\\', \\'source\\': {\\'label\\': \\'Pet\\'}, \\'target\\': {\\'label\\': \\'TransferCare\\'}, \\'attributes\\': []}]}\\n\\n\\nFor example, given the question \"Which managers own Neo4j stocks?\", the OpenCypher statement should look like this:\\n```\\nMATCH (m:Manager)-[:OWNS]->(s:Stock)\\nWHERE s.name CONTAINS \\'Neo4j\\'\\nRETURN m, s\\n```\\n'}, {'role': 'user', 'content': '\\nUsing the ontology provided, generate an OpenCypher statement to query the graph database returning all relevant entities, relationships, and attributes to answer the question below:\\nIf you cannot generate a OpenCypher statement for any reason, return an empty string.\\nRespect the order of the relationships, the arrows should always point from the \"source\" to the \"target\".\\n\\nQuestion: How does pet care work during transfer?\\n'}], 'model': 'gpt-4o', 'max_tokens': None, 'stop': None, 'temperature': None, 'top_p': None}}\n",
      "2024-07-24 11:12:35 Sending HTTP Request: POST https://api.openai.com/v1/chat/completions\n",
      "2024-07-24 11:12:35 connect_tcp.started host='api.openai.com' port=443 local_address=None timeout=5.0 socket_options=None\n",
      "2024-07-24 11:12:35 connect_tcp.complete return_value=<httpcore._backends.sync.SyncStream object at 0x11fda6f90>\n",
      "2024-07-24 11:12:35 start_tls.started ssl_context=<ssl.SSLContext object at 0x11fb26330> server_hostname='api.openai.com' timeout=5.0\n",
      "2024-07-24 11:12:35 start_tls.complete return_value=<httpcore._backends.sync.SyncStream object at 0x11fdbfcd0>\n",
      "2024-07-24 11:12:35 send_request_headers.started request=<Request [b'POST']>\n",
      "2024-07-24 11:12:35 send_request_headers.complete\n",
      "2024-07-24 11:12:35 send_request_body.started request=<Request [b'POST']>\n",
      "2024-07-24 11:12:35 send_request_body.complete\n",
      "2024-07-24 11:12:35 receive_response_headers.started request=<Request [b'POST']>\n",
      "2024-07-24 11:12:36 receive_response_headers.complete return_value=(b'HTTP/1.1', 200, b'OK', [(b'Date', b'Thu, 11 Jul 2024 08:12:36 GMT'), (b'Content-Type', b'application/json'), (b'Transfer-Encoding', b'chunked'), (b'Connection', b'keep-alive'), (b'openai-organization', b'falkordb'), (b'openai-processing-ms', b'784'), (b'openai-version', b'2020-10-01'), (b'strict-transport-security', b'max-age=31536000; includeSubDomains'), (b'x-ratelimit-limit-requests', b'10000'), (b'x-ratelimit-limit-tokens', b'22000000'), (b'x-ratelimit-remaining-requests', b'9999'), (b'x-ratelimit-remaining-tokens', b'21998436'), (b'x-ratelimit-reset-requests', b'6ms'), (b'x-ratelimit-reset-tokens', b'4ms'), (b'x-request-id', b'req_29abe6599cba22b64239449374442307'), (b'CF-Cache-Status', b'DYNAMIC'), (b'Set-Cookie', b'__cf_bm=MzquAv_cNzkSlAo9_vHNDvhhurx7E8blwxZXtt4lzlc-1720685556-1.0.1.1-UrCoAQ18fxoRV_TRzDIkJGM7V4s.HBjHEfg8zNglnZDUauepDnCnWJfuqIodb8zW27THm8GxFdLkbUe7D3iwlQ; path=/; expires=Thu, 11-Jul-24 08:42:36 GMT; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), (b'Set-Cookie', b'_cfuvid=irojzM9GTHI5tF4NHAzSVP.w7SPT2mh9UBfEwrguQws-1720685556480-0.0.1.1-604800000; path=/; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), (b'Server', b'cloudflare'), (b'CF-RAY', b'8a175450de824c4c-MXP'), (b'Content-Encoding', b'gzip'), (b'alt-svc', b'h3=\":443\"; ma=86400')])\n",
      "2024-07-24 11:12:36 HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "2024-07-24 11:12:36 receive_response_body.started request=<Request [b'POST']>\n",
      "2024-07-24 11:12:36 receive_response_body.complete\n",
      "2024-07-24 11:12:36 response_closed.started\n",
      "2024-07-24 11:12:36 response_closed.complete\n",
      "2024-07-24 11:12:36 HTTP Response: POST https://api.openai.com/v1/chat/completions \"200 OK\" Headers([('date', 'Thu, 11 Jul 2024 08:12:36 GMT'), ('content-type', 'application/json'), ('transfer-encoding', 'chunked'), ('connection', 'keep-alive'), ('openai-organization', 'falkordb'), ('openai-processing-ms', '784'), ('openai-version', '2020-10-01'), ('strict-transport-security', 'max-age=31536000; includeSubDomains'), ('x-ratelimit-limit-requests', '10000'), ('x-ratelimit-limit-tokens', '22000000'), ('x-ratelimit-remaining-requests', '9999'), ('x-ratelimit-remaining-tokens', '21998436'), ('x-ratelimit-reset-requests', '6ms'), ('x-ratelimit-reset-tokens', '4ms'), ('x-request-id', 'req_29abe6599cba22b64239449374442307'), ('cf-cache-status', 'DYNAMIC'), ('set-cookie', '__cf_bm=MzquAv_cNzkSlAo9_vHNDvhhurx7E8blwxZXtt4lzlc-1720685556-1.0.1.1-UrCoAQ18fxoRV_TRzDIkJGM7V4s.HBjHEfg8zNglnZDUauepDnCnWJfuqIodb8zW27THm8GxFdLkbUe7D3iwlQ; path=/; expires=Thu, 11-Jul-24 08:42:36 GMT; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), ('set-cookie', '_cfuvid=irojzM9GTHI5tF4NHAzSVP.w7SPT2mh9UBfEwrguQws-1720685556480-0.0.1.1-604800000; path=/; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), ('server', 'cloudflare'), ('cf-ray', '8a175450de824c4c-MXP'), ('content-encoding', 'gzip'), ('alt-svc', 'h3=\":443\"; ma=86400')])\n",
      "2024-07-24 11:12:36 request_id: req_29abe6599cba22b64239449374442307\n",
      "2024-07-24 11:12:36 Cypher Statement Response: GenerationResponse(text=```\n",
      "MATCH (p:Pet)-[:RECEIVES]->(tc:TransferCare)\n",
      "RETURN p, tc\n",
      "```, finish_reason=STOP)\n",
      "2024-07-24 11:12:36 Cypher: \n",
      "MATCH (p:Pet)-[:RECEIVES]->(tc:TransferCare)\n",
      "RETURN p, tc\n",
      "\n",
      "2024-07-24 11:12:36 Context: [['(:Pet{type:\"Dog\"})', '(:TransferCare{details:\"Pets will be cared for, walked, and monitored if the transfer in Doha exceeds 3 hours\"})'], ['(:Pet{type:\"Cat\"})', '(:TransferCare{details:\"Pets will be cared for, walked, and monitored if the transfer in Doha exceeds 3 hours\"})'], ['(:Pet{type:\"Bird\"})', '(:TransferCare{details:\"Pets will be cared for, walked, and monitored if the transfer in Doha exceeds 3 hours\"})'], ['(:Pet{max_per_cabin:\"6\",type:\"Falcon\"})', '(:TransferCare{details:\"Pets will be cared for, walked, and monitored if the transfer in Doha exceeds 3 hours\"})']]\n",
      "2024-07-24 11:12:36 Context size: 4\n",
      "2024-07-24 11:12:36 Context characters: 582\n",
      "2024-07-24 11:12:36 load_ssl_context verify=True cert=None trust_env=True http2=False\n",
      "2024-07-24 11:12:36 load_verify_locations cafile='/Users/davidzimberknopf/Documents/Apps/falkordb-gemini-kg/.venv/lib/python3.11/site-packages/certifi/cacert.pem'\n",
      "2024-07-24 11:12:36 Request options: {'method': 'post', 'url': '/chat/completions', 'files': None, 'json_data': {'messages': [{'role': 'system', 'content': \"\\nYou are an assistant that helps to form nice and human understandable answers.\\nThe information part contains the provided information that you must use to construct an answer.\\nThe provided information is authoritative, you must never doubt it or try to use your internal knowledge to correct it.\\nMake the answer sound as a response to the question. Do not mention that you based the result on the given information.\\nDo not answer more than the question asks for.\\nHere is an example:\\n\\nQuestion: Which managers own Neo4j stocks?\\nContext:[manager:CTL LLC, manager:JANE STREET GROUP LLC]\\nHelpful Answer: CTL LLC, JANE STREET GROUP LLC owns Neo4j stocks.\\n\\nIf the provided information is empty, say that you don't know the answer.\\n\"}, {'role': 'user', 'content': '\\nUse the following knowledge to answer the question at the end. \\n\\nCypher: \\nMATCH (p:Pet)-[:RECEIVES]->(tc:TransferCare)\\nRETURN p, tc\\n\\n\\nContext: [[\\'(:Pet{type:\"Dog\"})\\', \\'(:TransferCare{details:\"Pets will be cared for, walked, and monitored if the transfer in Doha exceeds 3 hours\"})\\'], [\\'(:Pet{type:\"Cat\"})\\', \\'(:TransferCare{details:\"Pets will be cared for, walked, and monitored if the transfer in Doha exceeds 3 hours\"})\\'], [\\'(:Pet{type:\"Bird\"})\\', \\'(:TransferCare{details:\"Pets will be cared for, walked, and monitored if the transfer in Doha exceeds 3 hours\"})\\'], [\\'(:Pet{max_per_cabin:\"6\",type:\"Falcon\"})\\', \\'(:TransferCare{details:\"Pets will be cared for, walked, and monitored if the transfer in Doha exceeds 3 hours\"})\\']]\\n\\nQuestion: How does pet care work during transfer?\\n\\nHelpful Answer:'}], 'model': 'gpt-4o', 'max_tokens': None, 'stop': None, 'temperature': None, 'top_p': None}}\n",
      "2024-07-24 11:12:36 Sending HTTP Request: POST https://api.openai.com/v1/chat/completions\n",
      "2024-07-24 11:12:36 connect_tcp.started host='api.openai.com' port=443 local_address=None timeout=5.0 socket_options=None\n",
      "2024-07-24 11:12:36 connect_tcp.complete return_value=<httpcore._backends.sync.SyncStream object at 0x10562b750>\n",
      "2024-07-24 11:12:36 start_tls.started ssl_context=<ssl.SSLContext object at 0x11fb27a40> server_hostname='api.openai.com' timeout=5.0\n",
      "2024-07-24 11:12:36 start_tls.complete return_value=<httpcore._backends.sync.SyncStream object at 0x11fd66f50>\n",
      "2024-07-24 11:12:36 send_request_headers.started request=<Request [b'POST']>\n",
      "2024-07-24 11:12:36 send_request_headers.complete\n",
      "2024-07-24 11:12:36 send_request_body.started request=<Request [b'POST']>\n",
      "2024-07-24 11:12:36 send_request_body.complete\n",
      "2024-07-24 11:12:36 receive_response_headers.started request=<Request [b'POST']>\n",
      "2024-07-24 11:12:37 receive_response_headers.complete return_value=(b'HTTP/1.1', 200, b'OK', [(b'Date', b'Thu, 11 Jul 2024 08:12:37 GMT'), (b'Content-Type', b'application/json'), (b'Transfer-Encoding', b'chunked'), (b'Connection', b'keep-alive'), (b'openai-organization', b'falkordb'), (b'openai-processing-ms', b'525'), (b'openai-version', b'2020-10-01'), (b'strict-transport-security', b'max-age=31536000; includeSubDomains'), (b'x-ratelimit-limit-requests', b'10000'), (b'x-ratelimit-limit-tokens', b'22000000'), (b'x-ratelimit-remaining-requests', b'9999'), (b'x-ratelimit-remaining-tokens', b'21999602'), (b'x-ratelimit-reset-requests', b'6ms'), (b'x-ratelimit-reset-tokens', b'1ms'), (b'x-request-id', b'req_44b226e61a7da5458d49581aa81fec12'), (b'CF-Cache-Status', b'DYNAMIC'), (b'Set-Cookie', b'__cf_bm=Hz99LzgP.chFQUi5DCjDvDqZZIvf5OKVAr.S3_cMAXM-1720685557-1.0.1.1-Ax_qe006_o6v07BsLU6fpnq4bKTYK4Lt3HLl2XzRdd1uVTEI327GYB0Bdf_SQKAtpw5ZRTvMV6PfpdCKZG1dOQ; path=/; expires=Thu, 11-Jul-24 08:42:37 GMT; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), (b'Set-Cookie', b'_cfuvid=.gTGxQWk2tvp0DysmC2ZEum0rW8mD9NL81lPIAN5i4g-1720685557414-0.0.1.1-604800000; path=/; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), (b'Server', b'cloudflare'), (b'CF-RAY', b'8a1754594f1083a8-MXP'), (b'Content-Encoding', b'gzip'), (b'alt-svc', b'h3=\":443\"; ma=86400')])\n",
      "2024-07-24 11:12:37 HTTP Request: POST https://api.openai.com/v1/chat/completions \"HTTP/1.1 200 OK\"\n",
      "2024-07-24 11:12:37 receive_response_body.started request=<Request [b'POST']>\n",
      "2024-07-24 11:12:37 receive_response_body.complete\n",
      "2024-07-24 11:12:37 response_closed.started\n",
      "2024-07-24 11:12:37 response_closed.complete\n",
      "2024-07-24 11:12:37 HTTP Response: POST https://api.openai.com/v1/chat/completions \"200 OK\" Headers([('date', 'Thu, 11 Jul 2024 08:12:37 GMT'), ('content-type', 'application/json'), ('transfer-encoding', 'chunked'), ('connection', 'keep-alive'), ('openai-organization', 'falkordb'), ('openai-processing-ms', '525'), ('openai-version', '2020-10-01'), ('strict-transport-security', 'max-age=31536000; includeSubDomains'), ('x-ratelimit-limit-requests', '10000'), ('x-ratelimit-limit-tokens', '22000000'), ('x-ratelimit-remaining-requests', '9999'), ('x-ratelimit-remaining-tokens', '21999602'), ('x-ratelimit-reset-requests', '6ms'), ('x-ratelimit-reset-tokens', '1ms'), ('x-request-id', 'req_44b226e61a7da5458d49581aa81fec12'), ('cf-cache-status', 'DYNAMIC'), ('set-cookie', '__cf_bm=Hz99LzgP.chFQUi5DCjDvDqZZIvf5OKVAr.S3_cMAXM-1720685557-1.0.1.1-Ax_qe006_o6v07BsLU6fpnq4bKTYK4Lt3HLl2XzRdd1uVTEI327GYB0Bdf_SQKAtpw5ZRTvMV6PfpdCKZG1dOQ; path=/; expires=Thu, 11-Jul-24 08:42:37 GMT; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), ('set-cookie', '_cfuvid=.gTGxQWk2tvp0DysmC2ZEum0rW8mD9NL81lPIAN5i4g-1720685557414-0.0.1.1-604800000; path=/; domain=.api.openai.com; HttpOnly; Secure; SameSite=None'), ('server', 'cloudflare'), ('cf-ray', '8a1754594f1083a8-MXP'), ('content-encoding', 'gzip'), ('alt-svc', 'h3=\":443\"; ma=86400')])\n",
      "2024-07-24 11:12:37 request_id: req_44b226e61a7da5458d49581aa81fec12\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Pets will be cared for, walked, and monitored if the transfer in Doha exceeds 3 hours.\n"
     ]
    }
   ],
   "source": [
    "questions = [\n",
    "    \"Can I take my dog with me on board?\",\n",
    "    \"How many falcons can I take with me on board?\",\n",
    "    \"How does pet care work during transfer?\"\n",
    "]\n",
    "for question in questions:\n",
    "    print(kg.ask(question))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
